<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x7F18;&amp;#x7531;&amp;#xA0;
&amp;#x672C;&amp;#x4EBA;&amp;#x5C24;&amp;#x5176;&amp;#x7684;&amp;#x949F;&amp;#x7231;iOS&amp;#x4E2D;&amp;#x5F97;&amp;#x67B6;&amp;#x6784;&amp;#x6280;&amp;#x672F;,&amp;#x672C;&amp;#x4EBA;&amp;#x4EE5;&amp;#x6458;&amp;#x6284;&amp;#x65B9;&amp;#x5F0F;&amp;#x8BB0;&amp;#x5F">
<meta property="og:type" content="article">
<meta property="og:title" content="iOS中应用的架构">
<meta property="og:url" content="http://yoursite.com/2015/11/12/ios-application-architecture/index.html">
<meta property="og:site_name" content="BirdMichael">
<meta property="og:description" content="&amp;#x7F18;&amp;#x7531;&amp;#xA0;
&amp;#x672C;&amp;#x4EBA;&amp;#x5C24;&amp;#x5176;&amp;#x7684;&amp;#x949F;&amp;#x7231;iOS&amp;#x4E2D;&amp;#x5F97;&amp;#x67B6;&amp;#x6784;&amp;#x6280;&amp;#x672F;,&amp;#x672C;&amp;#x4EBA;&amp;#x4EE5;&amp;#x6458;&amp;#x6284;&amp;#x65B9;&amp;#x5F0F;&amp;#x8BB0;&amp;#x5F">
<meta property="og:updated_time" content="2016-07-25T06:30:02.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="iOS中应用的架构">
<meta name="twitter:description" content="&amp;#x7F18;&amp;#x7531;&amp;#xA0;
&amp;#x672C;&amp;#x4EBA;&amp;#x5C24;&amp;#x5176;&amp;#x7684;&amp;#x949F;&amp;#x7231;iOS&amp;#x4E2D;&amp;#x5F97;&amp;#x67B6;&amp;#x6784;&amp;#x6280;&amp;#x672F;,&amp;#x672C;&amp;#x4EBA;&amp;#x4EE5;&amp;#x6458;&amp;#x6284;&amp;#x65B9;&amp;#x5F0F;&amp;#x8BB0;&amp;#x5F">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2015/11/12/ios-application-architecture/"/>

  <title> iOS中应用的架构 | BirdMichael </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">BirdMichael</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                iOS中应用的架构
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-11-12T20:14:43+08:00" content="2015-11-12">
              2015-11-12
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/摘。/" itemprop="url" rel="index">
                    <span itemprop="name">摘。</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="&#x7F18;&#x7531;"><a href="#&#x7F18;&#x7531;" class="headerlink" title="&#x7F18;&#x7531;"></a>&#x7F18;&#x7531;</h1><p>&#xA0;</p>
<p>&#x672C;&#x4EBA;&#x5C24;&#x5176;&#x7684;&#x949F;&#x7231;iOS&#x4E2D;&#x5F97;&#x67B6;&#x6784;&#x6280;&#x672F;,&#x672C;&#x4EBA;&#x4EE5;&#x6458;&#x6284;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x5E76;&#x5B66;&#x4E60;,&#x539F;&#x6587;&#x4F5C;&#x8005;&#x7530;&#x4F1F;&#x5B87;&#x5927;&#x795E;,<a href="http://casatwy.com" target="_blank" rel="external">http://casatwy.com</a>.</p>
<p>&#x5176;&#x5B9E;&#x5BF9;&#x4E8E;iOS&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7684;&#x67B6;&#x6784;&#x6765;&#x8BF4;&#xFF0C;&#x590D;&#x6742;&#x5EA6;&#x4E0D;&#x4E9A;&#x4E8E;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x4F46;&#x4FA7;&#x91CD;&#x70B9;&#x548C;&#x5165;&#x624B;&#x70B9;&#x5374;&#x8DDF;&#x670D;&#x52A1;&#x7AEF;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#x3002;&#x6BD4;&#x5982;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x7C7B;&#x4F3C;C10K&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6B63;&#x5E38;&#x7684;app&#x5C31;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x3002;</p>
<p>&#x8FD9;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x4F5C;&#x8005;&#x4E3B;&#x8981;&#x4E13;&#x6CE8;&#x5728;iOS&#x5E94;&#x7528;&#x67B6;&#x6784;&#x65B9;&#x9762;&#xFF0C;&#x5F88;&#x591A;&#x65B9;&#x6848;&#x4E5F;&#x662F;&#x57FA;&#x4E8E;iOS&#x6280;&#x672F;&#x6808;&#x7684;&#x7279;&#x70B9;&#x800C;&#x5EFA;&#x7ACB;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;Android&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4FA7;&#x91CD;&#x770B;&#x6211;&#x63D0;&#x51FA;&#x7684;&#x4E00;&#x4E9B;&#x67B6;&#x6784;&#x601D;&#x60F3;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E0D;&#x7BA1;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x601D;&#x8DEF;&#x662F;&#x76F8;&#x901A;&#x7684;&#xFF0C;&#x5B9E;&#x73B0;&#x624B;&#x6BB5;&#x4E0D;&#x540C;&#x7F62;&#x4E86;&#x3002;</p>
<h1 id="&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x67B6;&#x6784;&#xFF1F;"><a href="#&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x67B6;&#x6784;&#xFF1F;" class="headerlink" title="&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x67B6;&#x6784;&#xFF1F;"></a>&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x67B6;&#x6784;&#xFF1F;</h1><p>&#x5176;&#x5B9E;&#x5E02;&#x9762;&#x4E0A;&#x5927;&#x90E8;&#x5206;&#x5E94;&#x7528;&#x4E0D;&#x5916;&#x4E4E;&#x5C31;&#x662F;&#x98A0;&#x8FC7;&#x6765;&#x5012;&#x8FC7;&#x53BB;&#x5730;&#x505A;&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF1A;</p>
<div><br><pre class="lang:objc decode:true">    &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;     &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;     &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;     &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;<br>    |             |     |             |     |             |     |             |<br>    | &#x8C03;&#x7528;&#x7F51;&#x7EDC;API  | &#x2013;&gt; |   &#x5C55;&#x73B0;&#x5217;&#x8868;    | &#x2013;&gt; |  &#x9009;&#x62E9;&#x5217;&#x8868;    | &#x2013;&gt; |   &#x5C55;&#x73B0;&#x5355;&#x9875;   |<br>    |             |     |             |     |             |     |             |<br>    &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;     &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;     &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;     &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;<br>                               ^                                        |<br>                               |                                        |<br>                               |                                        |<br>                               &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;</pre><br></div><br>&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x7684;APP&#x6B65;&#x9AA4;&#x5176;&#x5B9E;: &#x8BF7;&#x6C42;&gt;&#x5C55;&#x793A;&#x5BF9;&#x5E94;&#x6570;&#x636E;|&gt;&#x8DF3;&#x8F6C;&#x5176;&#x4ED6;&#x63A7;&#x5236;&#x5668;&gt;&#x8BF7;&#x6C42;&gt;&#x5C55;&#x793A;&#x5BF9;&#x5E94;&#x6570;&#x636E;.<br><br>## &#x90A3;&#x8FD9;&#x7279;&#x4E48;&#x6709;&#x6BDB;&#x597D;&#x67B6;&#x6784;&#x7684;&#xFF1F;<br><br>&gt; &#x975E;&#x4E5F;&#xFF0C;&#x975E;&#x4E5F;&#x3002; &#x2014;- &#x5305;&#x4E0D;&#x540C; &#x300A;&#x5929;&#x9F99;&#x516B;&#x90E8;&#x300B;<br>App&#x786E;&#x5B9E;&#x5C31;&#x662F;&#x4E3B;&#x8981;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x652F;&#x6491;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5C31;&#x662F;&#x505A;&#x67B6;&#x6784;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E8B;&#x60C5;&#x3002;<br><br><em>   &#x8C03;&#x7528;&#x7F51;&#x7EDC;API
</em>   &#x9875;&#x9762;&#x5C55;&#x793A;<br><em>   &#x6570;&#x636E;&#x7684;&#x672C;&#x5730;&#x6301;&#x4E45;&#x5316;
</em>   &#x52A8;&#x6001;&#x90E8;&#x7F72;&#x65B9;&#x6848;<br>&#x4E0A;&#x9762;&#x8FD9;&#x56DB;&#x5927;&#x70B9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x6240;&#x8BF4;&#x7684;&#xFF1A;<br><br><em>   &#x5982;&#x4F55;&#x8BA9;&#x4E1A;&#x52A1;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#x65B9;&#x4FBF;&#x5B89;&#x5168;&#x5730;&#x8C03;&#x7528;&#x7F51;&#x7EDC;API&#xFF1F;&#x7136;&#x540E;&#x5C3D;&#x53EF;&#x80FD;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x5728;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E0B;&#x90FD;&#x80FD;&#x6709;&#x826F;&#x597D;&#x7684;&#x4F53;&#x9A8C;&#xFF1F;
</em>   &#x9875;&#x9762;&#x5982;&#x4F55;&#x7EC4;&#x7EC7;&#xFF0C;&#x624D;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x964D;&#x4F4E;&#x4E1A;&#x52A1;&#x65B9;&#x4EE3;&#x7801;&#x7684;&#x8026;&#x5408;&#x5EA6;&#xFF1F;&#x5C3D;&#x53EF;&#x80FD;&#x964D;&#x4F4E;&#x4E1A;&#x52A1;&#x65B9;&#x5F00;&#x53D1;&#x754C;&#x9762;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x63D0;&#x9AD8;&#x4ED6;&#x4EEC;&#x7684;&#x6548;&#x7387;&#xFF1F;<br><em>   &#x5F53;&#x6570;&#x636E;&#x6709;&#x5728;&#x672C;&#x5730;&#x5B58;&#x53D6;&#x7684;&#x9700;&#x6C42;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x4F55;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5728;&#x672C;&#x5730;&#x7684;&#x5408;&#x7406;&#x5B89;&#x6392;&#xFF1F;&#x5982;&#x4F55;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x51CF;&#x5C0F;&#x6027;&#x80FD;&#x6D88;&#x8017;&#xFF1F;
</em>   iOS&#x5E94;&#x7528;&#x6709;&#x5BA1;&#x6838;&#x5468;&#x671F;&#xFF0C;&#x5982;&#x4F55;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x4E0D;&#x53D1;&#x7248;&#x672C;&#x7684;&#x65B9;&#x5F0F;&#x5C55;&#x793A;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x7ED9;&#x7528;&#x6237;&#xFF1F;&#x5982;&#x4F55;&#x4FEE;&#x590D;&#x7D27;&#x6025;bug&#xFF1F;<br>&gt; &#x5176;&#x4E2D;&#x201D;&#x8C03;&#x7528;&#x7F51;&#x7EDC;API&#x201D;&#x548C;&#x201D;&#x9875;&#x9762;&#x5C55;&#x793A;&#x201D;&#x662F;&#x73B0;&#x5728;&#x767E;&#x5206;&#x4E4B;&#x4E5D;&#x5341;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x5DF2;&#x7ECF;&#x518D;&#x6D89;&#x730E;&#x6216;&#x8005;&#x8BF4;&#x5DF2;&#x7ECF;&#x505A;&#x5F97;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x597D;&#x4E86;,&#x800C;&#x5728;&#x201D;&#x6570;&#x636E;&#x7684;&#x672C;&#x5730;&#x6301;&#x4E45;&#x5316;&#x201D;&#x548C;&#x201D;&#x52A8;&#x6001;&#x90E8;&#x7F72;&#x65B9;&#x6848;&#x201D;&#x73B0;&#x5728;&#x73B0;&#x5728;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x9009;&#x62E9;&#x4E86;&#x81EA;&#x52A8;&#x5FFD;&#x89C6;.&#x5C24;&#x5176;&#x662F;&#x518D;&#x52A8;&#x6001;&#x90E8;&#x7F72;&#x65B9;&#x6848;&#x4E0A;,&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x5BF9;&#x65B0;&#x5185;&#x5BB9;&#x7684;&#x9009;&#x62E9;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x91CD;&#x65B0;&#x53D1;&#x7248;,&#x4F46;&#x662F;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;iOS&#x7684;&#x5BA1;&#x6838;&#x5468;&#x671F;&#x975E;&#x5E38;&#x7684;&#x86CB;&#x75BC;.<br>&#x4E0A;&#x9762;&#x51E0;&#x70B9;&#x662F;&#x9488;&#x5BF9;App&#x8BF4;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x9488;&#x5BF9;&#x56E2;&#x961F;&#x8BF4;&#x7684;&#xFF1A;<br><br><em>   &#x6536;&#x96C6;&#x7528;&#x6237;&#x6570;&#x636E;&#xFF0C;&#x7ED9;&#x4EA7;&#x54C1;&#x548C;&#x8FD0;&#x8425;&#x63D0;&#x4F9B;&#x53C2;&#x8003;
</em>   &#x5408;&#x7406;&#x5730;&#x7EC4;&#x7EC7;&#x5404;&#x4E1A;&#x52A1;&#x65B9;&#x5F00;&#x53D1;&#x7684;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#xFF0C;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x57FA;&#x7840;&#x6A21;&#x5757;<br><em>   &#x6BCF;&#x65E5;app&#x7684;&#x81EA;&#x52A8;&#x6253;&#x5305;&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;QA&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;<br>&#x4E00;&#x65F6;&#x534A;&#x4F1A;&#x513F;&#x6211;&#x8FD8;&#x662F;&#x53EA;&#x80FD;&#x60F3;&#x5230;&#x4E0A;&#x9762;&#x8FD9;&#x4E09;&#x70B9;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5E94;&#x8BE5;&#x8FD8;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x4E86;&#x3002;<br><br>&#x6240;&#x4EE5;&#x5F53;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;<br><br># &#x8FD9;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x8981;&#x56DE;&#x7B54;&#x90A3;&#x4E9B;&#x95EE;&#x9898;&#xFF1F;<br><br>&#x8FD9;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x4E3B;&#x8981;&#x662F;&#x56DE;&#x7B54;&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF1A;<br><br>1.  &#x7F51;&#x7EDC;&#x5C42;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#xFF1F;&#x8BBE;&#x8BA1;&#x7F51;&#x7EDC;&#x5C42;&#x65F6;&#x8981;&#x8003;&#x8651;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF1F;&#x5BF9;&#x7F51;&#x7EDC;&#x5C42;&#x505A;&#x4F18;&#x5316;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x5165;&#x624B;&#xFF1F;<br>2.  &#x9875;&#x9762;&#x7684;&#x5C55;&#x793A;&#x3001;&#x8C03;&#x7528;&#x548C;&#x7EC4;&#x7EC7;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#xFF1F;&#x6211;&#x4EEC;&#x505A;&#x8FD9;&#x4E9B;&#x65B9;&#x6848;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x8981;&#x8003;&#x8651;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF1F;<br>3.  &#x672C;&#x5730;&#x6301;&#x4E45;&#x5316;&#x5C42;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x4F18;&#x52A3;&#x52BF;&#x90FD;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4E0D;&#x540C;&#x65B9;&#x6848;&#x95F4;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x95EE;&#x9898;&#x5206;&#x522B;&#x90FD;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;<br>4.  &#x8981;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x90E8;&#x7F72;&#xFF0C;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x65B9;&#x6848;&#xFF1F;&#x4E0D;&#x540C;&#x65B9;&#x6848;&#x4E4B;&#x95F4;&#x7684;&#x4F18;&#x52A3;&#x70B9;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#xFF1F;<br><br># &#x672C;&#x6587;&#x8981;&#x56DE;&#x7B54;&#x90A3;&#x4E9B;&#x95EE;&#x9898;&#xFF1F;<br><br>&#x4E0A;&#x9762;&#x7EC6;&#x5206;&#x51FA;&#x6765;&#x7684;&#x56DB;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4F1A;&#x5206;&#x522B;&#x5728;&#x56DB;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#x5199;&#x3002;&#x90A3;&#x4E48;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x662F;&#x6765;&#x8BB2;&#x4E00;&#x4E9B;&#x901A;&#x8BC6;&#x5565;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x5F00;&#x4E2A;&#x5751;&#x7ED9;&#x5927;&#x5BB6;&#x8BA8;&#x8BBA;&#x901A;&#x8BC6;&#x95EE;&#x9898;&#x7684;&#x3002;<br><br># &#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x65B9;&#x6CD5;<br><br>&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x6700;&#x96BE;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x5F00;&#x59CB;&#x505A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x4F60;&#x5F00;&#x59CB;&#x7740;&#x624B;&#x8BBE;&#x8BA1;&#x5E76;&#x5B9E;&#x73B0;&#x67D0;&#x4E00;&#x5C42;&#x7684;&#x67B6;&#x6784;&#x4E43;&#x81F3;&#x6574;&#x4E2A;app&#x7684;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x6682;&#x65F6;&#x7684;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#x8BBA;&#x662F;&#x6211;&#x8FD9;&#x4E9B;&#x5E74;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6BCF;&#x4E2A;&#x67B6;&#x6784;&#x5E08;&#x4E5F;&#x4E00;&#x5B9A;&#x90FD;&#x6709;&#x4E00;&#x5957;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x4F46;&#x4E00;&#x6837;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x91C7;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF0C;&#x5168;&#x5C40;&#x89C2;&#x3001;&#x9AD8;&#x5EA6;&#x7684;&#x4EE3;&#x7801;&#x5BA1;&#x7F8E;&#x80FD;&#x529B;&#x3001;&#x7075;&#x6D3B;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E00;&#x5B9A;&#x90FD;&#x662F;&#x8D2F;&#x7A7F;&#x5176;&#x4E2D;&#x7684;&#x3002;&#x6B22;&#x8FCE;&#x5404;&#x4F4D;&#x5728;&#x8BC4;&#x8BBA;&#x533A;&#x8BA8;&#x8BBA;&#x3002;<br><br>## &#x7B2C;&#x4E00;&#x6B65;<br><br>&#x641E;&#x6E05;&#x695A;&#x8981;&#x89E3;&#x51B3;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x627E;&#x5230;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x5145;&#x8981;&#x6761;&#x4EF6;<br><br>&#x4F60;&#x5FC5;&#x987B;&#x5F97;&#x6E05;&#x695A;&#x4F60;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4E1A;&#x52A1;&#x65B9;&#x5E0C;&#x671B;&#x8981;&#x4EC0;&#x4E48;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x67B6;&#x6784;&#x800C;&#x67B6;&#x6784;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x4F53;&#x9A8C;&#x65B0;&#x6280;&#x672F;&#x800C;&#x6539;&#x67B6;&#x6784;&#x65B9;&#x6848;&#x3002;&#x4EE5;&#x524D;&#x662F;MVC&#xFF0C;&#x6700;&#x8FD1;&#x6D41;&#x884C;MVVM&#xFF0C;&#x5982;&#x679C;&#x8FC7;&#x53BB;&#x7684;MVC&#x662F;&#x4E2A;&#x597D;&#x67B6;&#x6784;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x5927;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x63A8;&#x5012;&#x7136;&#x540E;&#x641E;&#x6210;MVVM&#x3002;<br><br>&#x5173;&#x4E8E;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x6211;&#x4E5F;&#x8981;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x51FD;&#x6570;&#x662F;&#x9700;&#x8981;&#x989D;&#x5916;&#x53C2;&#x6570;&#x7684;&#xFF0C;&#x6BD4;&#x5982;read&#x51FD;&#x6570;&#x3002;&#x8FD8;&#x6709;&#x7FFB;&#x9875;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x524D;&#x9875;&#x7801;&#x4E5F;&#x662F;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x65B9;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x8FD8;&#x80FD;&#x591F;&#x518D;&#x7F29;&#x51CF;&#x3002;<br><br>&#x6BD4;&#x5982;read&#xFF0C;&#x9700;&#x8981;&#x7ED9;&#x51FA;file descriptor&#xFF0C;&#x9700;&#x8981;&#x7ED9;&#x51FA;buf&#xFF0C;&#x9700;&#x8981;&#x7ED9;&#x51FA;size&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x65B9;&#x6765;&#x8BF4;&#xFF0C;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x5C31;&#x53EA;&#x8981;file descriptor&#x5C31;&#x591F;&#x4E86;&#x3002;&#x518D;&#x6BD4;&#x5982;&#x7FFB;&#x9875;&#xFF0C;&#x5176;&#x5B9E;&#x4E1A;&#x52A1;&#x65B9;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x9875;&#x53F7;&#xFF0C;&#x4F60;&#x7ED9;&#x4ED6;&#x66B4;&#x9732;&#x4E00;&#x4E2A;loadNextPage&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x591F;&#x4E86;&#x3002;<br><br>&#x641E;&#x6E05;&#x695A;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x65B9;&#x800C;&#x8A00;&#x7684;&#x771F;&#x6B63;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x5F88;&#x91CD;&#x8981;&#xFF01;&#x8FD9;&#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x7684;&#x67B6;&#x6784;&#x662F;&#x5426;&#x8DB3;&#x591F;&#x6613;&#x7528;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4F20;&#x7684;&#x53C2;&#x6570;&#x8D8A;&#x5C11;&#xFF0C;&#x8026;&#x5408;&#x5EA6;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x5C31;&#x8D8A;&#x5C0F;&#xFF0C;&#x4F60;&#x66FF;&#x6362;&#x6A21;&#x5757;&#x6216;&#x8005;&#x5347;&#x7EA7;&#x6A21;&#x5757;&#x6240;&#x82B1;&#x7684;&#x7684;&#x4EE3;&#x4EF7;&#x5C31;&#x8D8A;&#x5C0F;&#x3002;<br><br>## &#x7B2C;&#x4E8C;&#x6B65;<br><br>&#x95EE;&#x9898;&#x5206;&#x7C7B;&#xFF0C;&#x5206;&#x6A21;&#x5757;<br><br>&#x8FD9;&#x4E2A;&#x4E0D;&#x7528;&#x591A;&#x8BF4;&#x4E86;&#x5427;&#x3002;<br><br>## &#x7B2C;&#x4E09;&#x6B65;<br><br>&#x641E;&#x6E05;&#x695A;&#x5404;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5EFA;&#x7ACB;&#x597D;&#x6A21;&#x5757;&#x4EA4;&#x6D41;&#x89C4;&#x8303;&#x5E76;&#x8BBE;&#x8BA1;&#x6A21;&#x5757;<br><br>&#x5173;&#x952E;&#x5728;&#x4E8E;&#x5EFA;&#x7ACB;&#x4E00;&#x5957;&#x7EDF;&#x4E00;&#x7684;&#x4EA4;&#x6D41;&#x89C4;&#x8303;&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x5F88;&#x80FD;&#x591F;&#x4F53;&#x73B0;&#x67B6;&#x6784;&#x5E08;&#x5728;&#x8F6F;&#x4EF6;&#x65B9;&#x9762;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#xFF0C;&#x867D;&#x7136;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7684;&#x597D;&#x574F;&#x4F18;&#x52A3;&#xFF08;&#x6BD4;&#x5982;&#x80D6;Model&#x548C;&#x7626;Model&#xFF09;&#xFF0C;&#x4F46;&#x65E2;&#x7136;&#x90FD;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x4E86;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E0D;&#x4F1A;&#x8BBE;&#x8BA1;&#x51FA;&#x660E;&#x663E;&#x5F88;&#x70C2;&#x7684;&#x65B9;&#x6848;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x8FD9;&#x67B6;&#x6784;&#x5E08;&#x8FD8;&#x4E0D;&#x591F;&#x683C;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x662F;&#x67B6;&#x6784;&#x5E08;&#x4EF7;&#x503C;&#x89C2;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x4EEC;&#x662F;&#x80FD;&#x591F;&#x770B;&#x51FA;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x7D20;&#x8D28;&#x7684;&#x3002;<br><br>&#x53E6;&#x5916;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x5EFA;&#x7ACB;&#x4E00;&#x5957;&#x7EDF;&#x4E00;&#x7684;&#x4EA4;&#x6D41;&#x89C4;&#x8303;&#xFF0C;&#x4E0D;&#x662F;&#x4E24;&#x5957;&#xFF0C;&#x4E0D;&#x662F;&#x591A;&#x5957;&#x3002;&#x4F60;&#x8981;&#x575A;&#x6301;&#x4F60;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#xFF0C;&#x4E0D;&#x8981;&#x6447;&#x6446;&#x4E0D;&#x5B9A;&#x3002;&#x8981;&#x662F;&#x641E;&#x51FA;&#x5404;&#x79CD;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x7684;&#x89C4;&#x8303;&#x51FA;&#x6765;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x6709;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x7684;&#x70AB;&#x6280;&#x5ACC;&#x7591;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x540E;&#x7EED;&#x7EF4;&#x62A4;&#x7684;&#x707E;&#x96BE;&#x3002;<br><br>## &#x7B2C;&#x56DB;&#x6B65;<br><br>&#x63A8;&#x6F14;&#x9884;&#x6D4B;&#x4E00;&#x4E0B;&#x672A;&#x6765;&#x53EF;&#x80FD;&#x7684;&#x8D70;&#x5411;&#xFF0C;&#x5FC5;&#x8981;&#x65F6;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x8BB0;&#x5F55;&#x66F4;&#x591A;&#x7684;&#x57FA;&#x7840;&#x6570;&#x636E;&#x4EE5;&#x5907;&#x672A;&#x6765;&#x4E4B;&#x9700;<br><br>&#x5F88;&#x591A;&#x79F0;&#x804C;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x90FD;&#x4F1A;&#x5728;&#x8FD9;&#x65F6;&#x5019;&#x8003;&#x8651;&#x67B6;&#x6784;&#x672A;&#x6765;&#x7684;&#x8D70;&#x5411;&#xFF0C;&#x4EE5;&#x53CA;&#x8003;&#x8651;&#x505A;&#x5B8C;&#x8FD9;&#x4E00;&#x8F6E;&#x67B6;&#x6784;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x67B6;&#x6784;&#x867D;&#x7136;&#x662F;&#x529F;&#x5728;&#x5F53;&#x4EE3;&#x5229;&#x5728;&#x5343;&#x79CB;&#x7684;&#x5DE5;&#x7A0B;&#xFF0C;&#x4F46;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x52B3;&#x6C38;&#x9038;&#x7684;&#x5DE5;&#x7A0B;&#x3002;&#x8F6F;&#x4EF6;&#x662F;&#x6709;&#x751F;&#x547D;&#x7684;&#xFF0C;&#x4F60;&#x505A;&#x51FA;&#x6765;&#x7684;&#x67B6;&#x6784;&#x51B3;&#x5B9A;&#x4E86;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x5B83;&#x8FD9;&#x4E00;&#x751F;&#x662F;&#x574E;&#x5777;&#x8FD8;&#x662F;&#x5E78;&#x798F;&#x3002;<br><br>## &#x7B2C;&#x4E94;&#x6B65;<br><br>&#x5148;&#x89E3;&#x51B3;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4E2D;&#x6700;&#x57FA;&#x7840;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5B9E;&#x73B0;&#x57FA;&#x7840;&#x6A21;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528;&#x57FA;&#x7840;&#x6A21;&#x5757;&#x5806;&#x53E0;&#x51FA;&#x6574;&#x4E2A;&#x67B6;&#x6784;<br><br>&#x8FD9;&#x4E00;&#x6B65;&#x4E5F;&#x662F;&#x9A8C;&#x8BC1;&#x4F60;&#x4E4B;&#x524D;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x5408;&#x7406;&#x7684;&#x4E00;&#x6B65;&#xFF0C;&#x968F;&#x7740;&#x8FD9;&#x4E00;&#x6B65;&#x7684;&#x63A8;&#x8FDB;&#xFF0C;&#x4F60;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x9700;&#x8981;&#x5BF9;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4E00;&#x5B9A;&#x8981;&#x5439;&#x6BDB;&#x6C42;&#x75B5;&#x9AD8;&#x5EA6;&#x8D1F;&#x8D23;&#x5730;&#x53BB;&#x5F00;&#x53D1;&#xFF0C;&#x4E0D;&#x8981;&#x5F97;&#x8FC7;&#x4E14;&#x8FC7;&#xFF0C;&#x53D1;&#x73B0;&#x67B6;&#x6784;&#x6709;&#x95EE;&#x9898;&#x5C31;&#x53CA;&#x65F6;&#x8C03;&#x6574;&#x3002;&#x5426;&#x5219;&#x4EE5;&#x540E;&#x8C03;&#x6574;&#x7684;&#x6210;&#x672C;&#x5C31;&#x975E;&#x5E38;&#x4E4B;&#x5927;&#x4E86;&#x3002;<br><br>&#x7B2C;&#x516D;&#x6B65;<br><br>&#x6253;&#x70B9;&#xFF0C;&#x8DD1;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x8DD1;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x6839;&#x636E;&#x6570;&#x636E;&#x53BB;&#x4F18;&#x5316;&#x5BF9;&#x5E94;&#x7684;&#x5730;&#x65B9;<br><br>&#x4F60;&#x5F97;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x53BB;&#x5411;&#x4F60;&#x7684;boss&#x9080;&#x529F;&#xFF0C;&#x4F60;&#x4E5F;&#x5F97;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x53BB;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#x4F60;&#x7684;&#x67B6;&#x6784;&#x3002;<br><br>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#x5C31;&#x662F;&#x8981;&#x9075;&#x5FAA;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#xFF1A;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x8BBE;&#x8BA1;&#xFF08;1&#xFF0C;2&#xFF0C;3&#xFF0C;4&#x6B65;&#xFF09;&#xFF0C;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x5B9E;&#x73B0;&#xFF08;5&#xFF09;&#xFF0C;&#x5148;&#x6D4B;&#x91CF;&#xFF0C;&#x540E;&#x4F18;&#x5316;&#xFF08;6&#xFF09;&#x3002;<br><br># &#x4EC0;&#x4E48;&#x6837;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x662F;&#x597D;&#x67B6;&#x6784;&#x5E08;&#xFF1F;

</em>   &#x6BCF;&#x5929;&#x90FD;&#x5728;&#x5B66;&#x4E60;&#xFF0C;&#x65B0;&#x6280;&#x672F;&#x65B0;&#x601D;&#x60F3;&#x4E0A;&#x624B;&#x901F;&#x5EA6;&#x5FEB;&#xFF0C;&#x7406;&#x89E3;&#x901F;&#x5EA6;&#x5FEB;<br>&#x505A;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x7801;&#x519C;<br><br><em>   &#x4E1A;&#x52A1;&#x51FA;&#x8EAB;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x975E;&#x5E38;&#x719F;&#x6089;&#x516C;&#x53F8;&#x6240;&#x5904;&#x884C;&#x4E1A;&#x6216;&#x8005;&#x672C;&#x516C;&#x53F8;&#x7684;&#x4E1A;&#x52A1;<br>&#x505A;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x8FD0;&#x7EF4;

</em>   &#x719F;&#x6089;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x5404;&#x79CD;&#x89C4;&#x8303;&#xFF0C;&#x8E29;&#x8FC7;&#x65E0;&#x6570;&#x5751;&#x3002;&#x4E0D;&#x4F1A;&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x9700;&#x6C42;&#x4E0D;&#x62E9;&#x624B;&#x6BB5;&#xFF0C;&#x4E0D;&#x63A8;&#x5D07;quick &amp; dirty<br>&#x505A;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x4F60;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x53BB;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x90A3;&#x513F;&#x5F53;&#x5DE5;&#x7A0B;&#x5E08;<br><br><em>   &#x53CA;&#x65F6;&#x627F;&#x8BA4;&#x9519;&#x8BEF;&#xFF0C;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x627F;&#x8BA4;&#x9519;&#x8BEF;&#x4F1A;&#x6709;&#x635F;&#x4F60;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x8EAB;&#x4EFD;<br>&#x505A;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x516C;&#x5173;&#x884C;&#x4E1A;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x4F60;

</em>   &#x4E0D;&#x4E3A;&#x4E86;&#x70AB;&#x6280;&#x800C;&#x70AB;&#x6280;<br>&#x505A;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x9AD8;&#x4E2D;&#x7F16;&#x7A0B;&#x7231;&#x597D;&#x8005;<br><br><em>   &#x7CBE;&#x76CA;&#x6C42;&#x7CBE;<br>&#x505A;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#xFF08;&#x6211;&#x60F3;&#x4E86;&#x597D;&#x4E45;&#xFF0C;&#x4F46;&#x6211;&#x8FD8;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x9002;&#x5408;&#x53BB;&#x5E72;&#x4EC0;&#x4E48;&#x3002;&#xFF09;<br><br># &#x4EC0;&#x4E48;&#x6837;&#x7684;&#x67B6;&#x6784;&#x53EB;&#x597D;&#x67B6;&#x6784;&#xFF1F;<br><br>1.  &#x4EE3;&#x7801;&#x6574;&#x9F50;&#xFF0C;&#x5206;&#x7C7B;&#x660E;&#x786E;&#xFF0C;&#x6CA1;&#x6709;common&#xFF0C;&#x6CA1;&#x6709;core<br>2.  &#x4E0D;&#x7528;&#x6587;&#x6863;&#xFF0C;&#x6216;&#x5F88;&#x5C11;&#x6587;&#x6863;&#xFF0C;&#x5C31;&#x80FD;&#x8BA9;&#x4E1A;&#x52A1;&#x65B9;&#x4E0A;&#x624B;<br>3.  &#x601D;&#x8DEF;&#x548C;&#x65B9;&#x6CD5;&#x8981;&#x7EDF;&#x4E00;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x591A;&#x5143;<br>4.  &#x6CA1;&#x6709;&#x6A2A;&#x5411;&#x4F9D;&#x8D56;&#xFF0C;&#x4E07;&#x4E0D;&#x5F97;&#x5DF2;&#x4E0D;&#x51FA;&#x73B0;&#x8DE8;&#x5C42;&#x8BBF;&#x95EE;<br>5.  &#x5BF9;&#x4E1A;&#x52A1;&#x65B9;&#x8BE5;&#x9650;&#x5236;&#x7684;&#x5730;&#x65B9;&#x6709;&#x9650;&#x5236;&#xFF0C;&#x8BE5;&#x7075;&#x6D3B;&#x7684;&#x5730;&#x65B9;&#x8981;&#x7ED9;&#x4E1A;&#x52A1;&#x65B9;&#x521B;&#x9020;&#x7075;&#x6D3B;&#x5B9E;&#x73B0;&#x7684;&#x6761;&#x4EF6;<br>6.  &#x6613;&#x6D4B;&#x8BD5;&#xFF0C;&#x6613;&#x62D3;&#x5C55;<br>7.  &#x4FDD;&#x6301;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x8D85;&#x524D;&#x6027;<br>8.  &#x63A5;&#x53E3;&#x5C11;&#xFF0C;&#x63A5;&#x53E3;&#x53C2;&#x6570;&#x5C11;<br>9.  &#x9AD8;&#x6027;&#x80FD;<br>&#x4EE5;&#x4E0A;&#x662F;&#x6211;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x67B6;&#x6784;&#x662F;&#x4E0D;&#x662F;&#x597D;&#x67B6;&#x6784;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x8FD9;&#x662F;&#x6839;&#x636E;&#x91CD;&#x8981;&#x6027;&#x6765;&#x6392;&#x5217;&#x7684;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x67B6;&#x6784;&#x8DDF;&#x670D;&#x52A1;&#x7AEF;&#x67B6;&#x6784;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x548C;&#x4FA7;&#x91CD;&#x70B9;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x533A;&#x522B;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4F1A;&#x9488;&#x5BF9;&#x6BCF;&#x4E00;&#x70B9;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x4E00;&#x4E0B;&#xFF1A;

</em>   &#x4EE3;&#x7801;&#x6574;&#x9F50;&#xFF0C;&#x5206;&#x7C7B;&#x660E;&#x786E;&#xFF0C;&#x6CA1;&#x6709;common&#xFF0C;&#x6CA1;&#x6709;core<br>&#x4EE3;&#x7801;&#x6574;&#x9F50;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x57FA;&#x672C;&#x7D20;&#x8D28;&#xFF0C;&#x5148;&#x4E0D;&#x8BF4;&#x4F60;&#x641E;&#x5B9A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6848;&#x6709;&#x591A;&#x597D;&#xFF0C;&#x89E3;&#x51B3;&#x901F;&#x5EA6;&#x6709;&#x591A;&#x5FEB;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E0D;&#x6574;&#x9F50;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x767D;&#x642D;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x8981;&#x7ED9;&#x522B;&#x4EBA;&#x770B;&#x7684;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x4E5F;&#x8981;&#x770B;&#x3002;&#x5982;&#x679C;&#x54EA;&#x4E00;&#x5929;&#x67B6;&#x6784;&#x6709;&#x4FEE;&#x6539;&#xFF0C;&#x6B63;&#x597D;&#x6539;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x4F60;&#x5F88;&#x5BB9;&#x6613;&#x81EA;&#x5DF1;&#x90FD;&#x770B;&#x4E0D;&#x61C2;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x7834;&#x7A97;&#x7406;&#x8BBA;&#x63D0;&#x9192;&#x6211;&#x4EEC;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E0D;&#x6574;&#x9F50;&#x5206;&#x7C7B;&#x4E0D;&#x660E;&#x786E;&#xFF0C;&#x6574;&#x4E2A;&#x67B6;&#x6784;&#x4F1A;&#x968F;&#x7740;&#x4E00;&#x6B21;&#x4E00;&#x6B21;&#x7684;&#x62D3;&#x5C55;&#x800C;&#x8D8A;&#x6765;&#x8D8A;&#x6DF7;&#x4E71;&#x3002;<br><br>&#x5206;&#x7C7B;&#x660E;&#x786E;&#x7684;&#x5B57;&#x9762;&#x610F;&#x601D;&#x5927;&#x5BB6;&#x4E00;&#x5B9A;&#x90FD;&#x4E86;&#x89E3;&#xFF0C;&#x4F46;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x53E6;&#x5916;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF1A;&#x4E0D;&#x8981;&#x8BA9;&#x4E00;&#x4E2A;&#x7C7B;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x505A;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x679C;&#x6709;&#x7C7B;&#x6216;&#x67D0;&#x6A21;&#x5757;&#x505A;&#x4E86;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x4E0D;&#x9002;&#x5408;&#x672A;&#x6765;&#x62D3;&#x5C55;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x4E5F;&#x4F1A;&#x9020;&#x6210;&#x5206;&#x7C7B;&#x56F0;&#x96BE;&#x3002;<br><br>&#x4E0D;&#x8981;&#x641E;Common&#xFF0C;Core&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x6BCF;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x67B6;&#x6784;&#x4EE3;&#x7801;&#x5E93;&#x91CC;&#x9762;&#xFF0C;&#x6700;&#x6076;&#x5FC3;&#x7684;&#x4E00;&#x5B9A;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x540D;&#x5B57;&#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x6211;&#x8FD9;&#x4E48;&#x8BF4;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x9519;&#x3002;&#x4E0D;&#x8981;&#x5F00;Common&#xFF0C;Core&#x8FD9;&#x6837;&#x7684;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x5F00;&#x4E86;&#x4E4B;&#x540E;&#x540E;&#x6765;&#x8005;&#x4E00;&#x5B9A;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x641E;&#x5F97;&#x4E00;&#x56E2;&#x7CDF;&#xFF0C;&#x6700;&#x7EC8;&#x53D8;&#x6210;Common&#x4E5F;&#x4E0D;Common&#xFF0C;Core&#x4E5F;&#x4E0D;Core&#x3002;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x67B6;&#x6784;&#x662F;&#x4E0D;&#x65AD;&#x6210;&#x957F;&#x7684;&#xFF0C;&#x662F;&#x4F1A;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x3002;&#x4E0D;&#x662F;&#x6BCF;&#x6B21;&#x6210;&#x957F;&#x6BCF;&#x6B21;&#x53D8;&#x5316;&#xFF0C;&#x90FD;&#x662F;&#x7531;&#x4F60;&#x53BB;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5982;&#x679C;&#x771F;&#x6709;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x7279;&#x522B;&#x5C0F;&#xFF0C;&#x90A3;&#x5C31;&#x7D22;&#x6027;&#x4E3A;&#x4E86;&#x4ED6;&#x5355;&#x72EC;&#x5F00;&#x8F9F;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x5C0F;&#x5C31;&#x5C0F;&#x70B9;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x8981;&#x6709;&#x5E8F;&#x3002;<br><br>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x516C;&#x5171;&#x7C7B;&#xFF0C;&#x6BD4;&#x5982;&#x53D6;&#x5B9A;&#x4F4D;&#x5750;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x5C31;h&#x548C;m&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x5355;&#x72EC;&#x62CE;&#x51FA;&#x6765;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x611F;&#x89C9;&#x4E0D;&#x591F;&#x683C;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4E0D;&#x5C5E;&#x4E8E;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x4E8E;&#x662F;&#x5927;&#x5BB6;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x628A;&#x5B83;&#x4EEC;&#x653E;&#x5165;Common&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x76EE;&#x524D;&#x89C1;&#x5230;&#x7684;&#x5927;&#x591A;&#x6570;&#x5DE5;&#x7A0B;&#x548C;&#x5927;&#x591A;&#x6570;&#x6587;&#x6863;&#x91CC;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x559C;&#x6B22;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x5728;&#x5F53;&#x65F6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#x770B;&#x4E0D;&#x51FA;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5173;&#x952E;&#x5728;&#x4E8E;&#xFF1A;&#x8F6F;&#x4EF6;&#x662F;&#x6709;&#x751F;&#x547D;&#xFF0C;&#x4F1A;&#x6210;&#x957F;&#x7684;&#x3002;&#x5F53;&#x65F6;&#x5206;&#x51FA;&#x6765;&#x7684;&#x5C0F;&#x6A21;&#x5757;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x9010;&#x6E10;&#x53D1;&#x5C55;&#x6210;&#x5927;&#x6A21;&#x5757;&#xFF0C;&#x53D1;&#x5C55;&#x6210;&#x5927;&#x6A21;&#x5757;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x628A;&#x5B83;&#x4ECE;Common&#x79FB;&#x51FA;&#x6765;&#x5355;&#x72EC;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4E2A;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x62D3;&#x5F20;&#x8FD9;&#x4E2A;&#x5C0F;&#x6A21;&#x5757;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x4F1A;&#x53BB;&#x8003;&#x8651;&#x6A2A;&#x5411;&#x4F9D;&#x8D56;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x65F6;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x90FD;&#x5728;Common&#x91CC;&#x9762;&#xFF0C;&#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x4E92;&#x76F8;&#x4F9D;&#x8D56;&#x662F;&#x975E;&#x5E38;&#x7B26;&#x5408;&#x76F4;&#x89C9;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x4E0D;&#x7B97;&#x662F;&#x4E0D;&#x9075;&#x5B88;&#x89C4;&#x8303;&#x3002;&#x7136;&#x800C;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x624D;&#x662F;Commom&#x4EE3;&#x7801;&#x6DF7;&#x4E71;&#x7684;&#x7F6A;&#x9B41;&#x7978;&#x9996;&#xFF0C;Common&#x6587;&#x4EF6;&#x5939;&#x7EB5;&#x5BB9;&#x4E86;&#x4E0D;&#x7CBE;&#x5FC3;&#x7BA1;&#x7406;&#x4F9D;&#x8D56;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x5F53;Common&#x91CC;&#x9762;&#x7684;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x518D;&#x60F3;&#x8981;&#x79FB;&#x51FA;&#x6765;&#x5355;&#x72EC;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x5C31;&#x4E0D;&#x662F;&#x5F53;&#x521D;&#x8BBE;&#x7F6E;Common&#x65F6;&#x60F3;&#x7684;&#x7B49;&#x89C4;&#x6A21;&#x5927;&#x4E86;&#x518D;&#x79FB;&#x9664;&#x4E5F;&#x4E0D;&#x8FDF;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x4E86;&#x3002;<br>&gt; &#x53E6;&#x5916;&#xFF0C;Common&#x6709;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#x3002;<br>&#x5728;&#x4F7F;&#x7528;Cocoapods&#x6765;&#x7BA1;&#x7406;&#x9879;&#x76EE;&#x5E93;&#x7684;&#x65F6;&#x5019;&#xFF0C;Common&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x4E00;&#x4E2A;pod&#x3002;&#x8FD9;&#x4E2A;pod&#x91CC;&#x9762;&#x4F1A;&#x6709;A/B/C/D/E&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x96C6;&#x6216;&#x5C0F;&#x6A21;&#x5757;&#x3002;&#x5982;&#x679C;&#x8981;&#x65B0;&#x5F00;&#x4E00;&#x4E2A;app&#x6216;&#x8005;Demo&#xFF0C;&#x52BF;&#x5FC5;&#x4F1A;&#x4F7F;&#x7528;&#x5230;Common&#x8FD9;&#x4E2A;pod&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x628A;&#x4E0D;&#x9700;&#x8981;&#x5305;&#x542B;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x5305;&#x542B;&#x8FDB;&#x53BB;&#xFF0C;&#x6211;&#x5BF9;&#x9879;&#x76EE;&#x6709;&#x9AD8;&#x5EA6;&#x6D01;&#x7656;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4F1A;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x4E0D;&#x8212;&#x670D;&#x3002;<br><br><em> </em> <em><br><br>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x65E9;&#x5E74;&#x5B89;&#x5C45;&#x5BA2;&#x7684;app&#x8FD8;&#x4E0D;&#x662F;&#x96C6;&#x9F50;&#x6240;&#x6709;&#x65B0;&#x623F;&#x3001;&#x4E8C;&#x624B;&#x623F;&#x3001;&#x79DF;&#x623F;&#x4E1A;&#x52A1;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x521A;&#x5F00;&#x59CB;&#x5199;&#x65B0;&#x623F;&#x8FD9;&#x4E2A;app&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;Common&#x8FD9;&#x4E2A;pod&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E9B;&#x5BF9;&#x4E8E;&#x65B0;&#x623F;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;Common&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;app&#x6765;&#x8BF4;&#x6BD4;&#x8F83;Common&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8FC7;&#x4E86;&#x534A;&#x5E74;&#x6216;&#x8005;&#x4E00;&#x5E74;&#xFF0C;&#x4F60;&#x8981;&#x5F00;&#x59CB;&#x4E8C;&#x624B;&#x623F;&#x8FD9;&#x4E2A;app&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x8BA9;&#x4E8C;&#x624B;&#x623F;&#x4E5F;&#x5305;&#x542B;&#x8FD9;&#x4E2A;Common&#xFF0C;&#x4E8E;&#x662F;&#x8FD9;&#x4E2A;Common&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x81EA;&#x5DF1;&#x8D70;&#x4E0A;&#x53E6;&#x4E00;&#x6761;&#x53D1;&#x5C55;&#x7684;&#x9053;&#x8DEF;&#x3002;&#x7B49;&#x5230;&#x4E86;&#x79DF;&#x623F;&#x8FD9;&#x4E2A;&#x4E1A;&#x52A1;&#x8981;&#x5F00;app&#x7684;&#x65F6;&#x5019;&#xFF0C;Common&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x4E4B;&#x5E9E;&#x5927;&#xFF0C;&#x76F8;&#x4FE1;&#x8FD9;&#x65F6;&#x5019;&#x7684;&#x4F60;&#x4E5F;&#x4E0D;&#x4F1A;&#x53BB;&#x60F3;&#x6574;&#x7406;Common&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x5148;&#x628A;&#x79DF;&#x623F;&#x641E;&#x5B9A;&#xFF0C;&#x4E8E;&#x662F;Common&#x6700;&#x7EC8;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x5768;&#x5C4E;&#x3002;<br><br>&#x5C31;&#x5BF9;&#x4E8E;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#xFF0C;&#x5206;&#x51FA;&#x6765;&#x7684;&#x4E09;&#x4E2A;&#x4E1A;&#x52A1;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E09;&#x4E2A;Common&#xFF0C;&#x5047;&#x8BBE;&#x4E09;&#x4E2A;Common&#x91CC;&#x9762;&#x90FD;&#x6709;&#x516C;&#x5171;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4EA4;&#x7ED9;&#x4E86;&#x4E09;&#x4E2A;&#x56E2;&#x961F;&#x53BB;&#x6253;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;&#x67D0;&#x4E2A;&#x5B50;&#x6A21;&#x5757;&#x9700;&#x8981;&#x5347;&#x7EA7;&#xFF0C;&#x90A3;&#x4E48;&#x4E09;&#x4E2A;Common&#x91CC;&#x9762;&#x7684;&#x8FD9;&#x4E2A;&#x5B50;&#x6A21;&#x5757;&#x90FD;&#x8981;&#x53BB;&#x540C;&#x6B65;&#x5347;&#x7EA7;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x5F88;&#x4E0D;&#x6548;&#x7387;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4E09;&#x4E2A;Common&#x5230;&#x6700;&#x540E;&#x53D1;&#x5C55;&#x6210;&#x5F7C;&#x6B64;&#x4E0D;&#x517C;&#x5BB9;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x76F8;&#x4F3C;&#x5EA6;&#x975E;&#x5E38;&#x4E4B;&#x9AD8;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x67B6;&#x6784;&#x4E0A;&#xFF0C;&#x662F;&#x5C5E;&#x4E8E;&#x5206;&#x7C7B;&#x6761;&#x7406;&#x4E0D;&#x6E05;&#x3002;<br><br>&#x5C31;&#x5728;&#x53BB;&#x5E74;&#x5E74;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B89;&#x5C45;&#x5BA2;&#x51B3;&#x5B9A;&#x5C06;&#x4E09;&#x4E2A;&#x4E1A;&#x52A1;&#x5F52;&#x5E76;&#x5230;&#x540C;&#x4E00;&#x4E2A;App&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x9762;&#x5BF9;&#x8FD9;&#x4E09;&#x4E2A;Common&#xFF0C;&#x4F60;&#x6253;&#x7B97;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x8981;&#x60F3;&#x6700;&#x5FEB;&#x51FA;&#x6210;&#x679C;&#xFF0C;&#x90A3;&#x5C31;&#x53EA;&#x597D;&#x5FCD;&#x53D7;&#x4EE3;&#x7801;&#x5197;&#x4F59;&#xFF0C;&#x8D76;&#x7D27;&#x5148;&#x628A;&#x67B6;&#x5B50;&#x642D;&#x8D77;&#x6765;&#x518D;&#x8BF4;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x9762;&#x5BF9;&#x7684;&#x5C31;&#x662F;&#x526A;&#x4E0D;&#x65AD;&#x7406;&#x8FD8;&#x4E71;&#x7684;Common&#x3002;&#x6B64;&#x65F6;Common&#x5C31;&#x5DF2;&#x7ECF;&#x5F88;&#x65E0;&#x5948;&#x5730;&#x53D8;&#x6210;&#x4E00;&#x5768;&#x5C4E;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x7684;Common&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x8BF4;&#x4E0D;&#x5B9A;&#x4E5F;&#x641E;&#x4E0D;&#x6E05;&#x695A;&#x5B83;&#x91CC;&#x9762;&#x5230;&#x5E95;&#x90FD;&#x6709;&#x4E9B;&#x4EC0;&#x4E48;&#x4E86;&#xFF0C;&#x4EA4;&#x7ED9;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x6253;&#x7406;&#xFF0C;&#x4ED6;&#x90FD;&#x4E0D;&#x6562;&#x505A;&#x5F7B;&#x5E95;&#x7684;&#x6574;&#x7406;&#x7684;&#x3002;

</em> <em> </em><br><br>&#x8FD8;&#x6709;&#x5C31;&#x662F;&#xFF0C;Common&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7C92;&#x5EA6;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6A21;&#x5757;&#x3002;&#x5728;&#x963F;&#x91CC;&#x8FD9;&#x6837;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x5373;&#x4FBF;&#x65B0;&#x5F00;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x5728;&#x6574;&#x4E2A;app&#x7684;&#x73AF;&#x5883;&#x4E0B;&#x5F00;&#x53D1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x56E0;&#x4E3A;&#x6A21;&#x5757;&#x62C6;&#x5206;&#x7C92;&#x5EA6;&#x4E0D;&#x591F;&#xFF0C;&#x8981;&#x60F3;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x4E1A;&#x52A1;&#xFF0C;&#x5FC5;&#x987B;&#x628A;&#x5176;&#x4ED6;&#x4E1A;&#x52A1;&#x7684;&#x4EE3;&#x7801;&#x4EE5;&#x53CA;&#x4F9D;&#x8D56;&#x5168;&#x90E8;&#x62C9;&#x4E0B;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5F00;&#x65B0;&#x5165;&#x53E3;&#xFF0C;&#x4F60;&#x7684;&#x65B0;&#x4E1A;&#x52A1;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x6B63;&#x5E38;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x548C;&#x8C03;&#x8BD5;&#x3002;&#x7136;&#x800C;&#x4F60;&#x7684;&#x65B0;&#x4E1A;&#x52A1;&#x5176;&#x5B9E;&#x53EA;&#x4F9D;&#x8D56;&#x9996;&#x9875;&#x5165;&#x53E3;&#x3001;&#x7F51;&#x7EDC;&#x5E93;&#x7B49;&#x8FD9;&#x51E0;&#x4E2A;&#x5C0F;&#x6A21;&#x5757;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x5176;&#x4ED6;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x8DDF;&#x4F60;&#x6CA1;&#x5173;&#x7CFB;&#x7684;&#x4E1A;&#x52A1;&#x3002;&#x73B0;&#x5728;&#x6BCF;&#x6B21;&#x6253;&#x5F00;&#x5929;&#x732B;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x90FD;&#x8981;&#x7B49;&#x4E2A;&#x4E24;&#x4E09;&#x5206;&#x949F;&#xFF0C;&#x8FD9;&#x975E;&#x5E38;&#x4E4B;&#x86CB;&#x75BC;&#x3002;<br><br>&#x4F46;&#x662F;&#x5927;&#x5BB6;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#x5417;&#xFF1F;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x4EBA;&#x53BB;&#x628A;&#x8FD9;&#x4E9B;&#x7C92;&#x5EA6;&#x4E0D;&#x591F;&#x7EC6;&#x7684;&#x6A21;&#x5757;&#x6574;&#x7406;&#x597D;&#xFF1F;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4EF6;&#x4E8B;&#x6CA1;&#x4EBA;&#x6562;&#x505A;&#x3002;<br><br>1.  &#x539F;&#x6765;&#x5927;&#x5BB6;&#x7528;&#x7684;&#x597D;&#x597D;&#x7684;&#xFF0C;&#x624B;&#x6BB5;&#x70C2;&#x5C31;&#x70C2;&#x4E00;&#x70B9;&#xFF0C;&#x4F60;&#x6539;&#x4E86;&#x4F60;&#x80FD;&#x4FDD;&#x8BC1;&#x4E0D;&#x51FA;&#x9519;&#xFF1F;<br>2.  &#x8FD9;&#x4E48;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x77ED;&#x671F;&#x4E4B;&#x5185;&#x4F60;&#x80AF;&#x5B9A;&#x641E;&#x4E0D;&#x597D;&#xFF0C;&#x4EFB;&#x52A1;&#x91CF;&#x548C;&#x5DE5;&#x65F6;&#x90FD;&#x4E0D;&#x597D;&#x4F30;&#xFF0C;&#x4F60;leader&#x4F1A;&#x89C9;&#x5F97;&#x4F60;&#x5728;&#x9A97;&#x5DE5;&#x65F6;&#x73A9;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x3002;<br>3.  &#x5C31;&#x7B97;&#x4F60;&#x641E;&#x5B9A;&#x4E86;&#xFF0C;QA&#x8FD9;&#x8FB9;&#x80AF;&#x5B9A;&#x518D;&#x9700;&#x8981;&#x505A;&#x4E00;&#x6B21;&#x5168;&#x9762;&#x7684;&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EFB;&#x52A1;&#x91CF;&#x6781;&#x5927;&#xFF0C;&#x96BE;&#x4EE5;&#x8BF4;&#x670D;&#x4ED6;&#x4EEC;&#x914D;&#x5408;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x3002;<br>&#x82B1;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x6210;&#x672C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x5F00;&#x542F;&#x9879;&#x76EE;&#x65F6;&#x5019;&#x7B49;&#x5F85;IDE&#x6253;&#x5F00;&#x65F6;&#x7684;&#x90A3;&#x51E0;&#x5206;&#x949F;&#x65F6;&#x95F4;&#xFF1F;&#x6211;&#x60F3;&#x5982;&#x679C;&#x6211;&#x662F;&#x4F60;leader&#xFF0C;&#x6211;&#x4E5F;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x6279;&#x51C6;&#x4F60;&#x505A;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E0E;&#x5176;&#x5230;&#x4E86;&#x540E;&#x9762;&#x5403;&#x8FD9;&#x4E2A;&#x82E6;&#x5934;&#xFF0C;&#x4E0D;&#x5982;&#x4E00;&#x5F00;&#x59CB;&#x505A;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x8981;&#x8BBE;&#x7F6E;Common&#xFF0C;&#x5230;&#x540E;&#x9762;&#x5C31;&#x80FD;&#x7701;&#x529B;&#x5F88;&#x591A;&#x3002;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x5DE5;&#x4F5C;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x529F;&#x5728;&#x5F53;&#x4EE3;&#x5229;&#x5728;&#x5343;&#x79CB;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x7D20;&#x8D28;&#x4E3A;&#x4EC0;&#x4E48;&#x5BF9;&#x56E2;&#x961F;&#x8FD9;&#x4E48;&#x91CD;&#x8981;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6700;&#x597D;&#x7684;&#x4F53;&#x73B0;&#x3002;<br><br><em> </em> <em><br><br>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x4E0D;&#x5EFA;&#x8BAE;&#x5F00;Common&#x7684;&#x539F;&#x56E0;&#x5982;&#x4E0B;&#xFF1A;<br><br>1.  Common&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x662F;&#x4E00;&#x4E2A;Pod&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5728;Common&#x91CC;&#x9762;&#x5F88;&#x5BB9;&#x6613;&#x5F62;&#x6210;&#x9519;&#x7EFC;&#x590D;&#x6742;&#x7684;&#x5C0F;&#x6A21;&#x5757;&#x4F9D;&#x8D56;&#xFF0C;&#x5728;&#x6A21;&#x5757;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x7EB5;&#x5BB9;&#x5DE5;&#x7A0B;&#x5E08;&#x4E0D;&#x6CE8;&#x610F;&#x4F9D;&#x8D56;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x4E43;&#x81F3;&#x4E8E;&#x5C06;&#x6765;&#x5982;&#x679C;&#x8981;&#x5C06;&#x6A21;&#x5757;&#x62C6;&#x5206;&#x51FA;&#x53BB;&#xFF0C;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x56F0;&#x96BE;&#x3002;<br>2.  Common&#x672C;&#x8EAB;&#x4E0E;&#x7EC6;&#x7C92;&#x5EA6;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x7684;&#x601D;&#x60F3;&#x80CC;&#x9053;&#x800C;&#x9A70;&#xFF0C;&#x5C5E;&#x4E8E;&#x4E00;&#x79CD;&#x4E0D;&#x5408;&#x9002;&#x7684;&#x5077;&#x61D2;&#x624B;&#x6BB5;&#xFF0C;&#x5728;&#x5C06;&#x6765;&#x4E1A;&#x52A1;&#x62D3;&#x5F20;&#x4F1A;&#x6210;&#x4E3A;&#x963B;&#x788D;&#x3002;<br>3.  &#x4E00;&#x65E6;&#x8BBE;&#x7F6E;&#x4E86;Common&#xFF0C;&#x5C31;&#x7B49;&#x4E8E;&#x7ED9;&#x5730;&#x72F1;&#x4E4B;&#x95E8;&#x6253;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x7F1D;&#xFF0C;&#x6BCF;&#x6B21;&#x4E1A;&#x52A1;&#x8FED;&#x4EE3;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x592A;&#x597D;&#x5206;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x653E;&#x5165;Common&#xFF0C;&#x8FD9;&#x5C31;&#x7ED9;&#x7EF4;&#x62A4;Common&#x7684;&#x4EBA;&#x5E26;&#x6765;&#x4E86;&#x975E;&#x5E38;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x91CF;&#x5168;&#x90FD;&#x662F;&#x4F53;&#x529B;&#x6D3B;&#xFF0C;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;<br>&gt; &#x90A3;&#x4E48;&#xFF0C;&#x4E0D;&#x8BBE;Common&#x4F1A;&#x5E26;&#x6765;&#x54EA;&#x4E9B;&#x597D;&#x5904;&#xFF1F;<br><br>1.  &#x5F3A;&#x8FEB;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x4E1A;&#x52A1;&#x62D3;&#x5F20;&#x7684;&#x65F6;&#x5019;&#x5C06;&#x4F9D;&#x8D56;&#x7BA1;&#x7406;&#x7684;&#x4E8B;&#x60C5;&#x8003;&#x8651;&#x8FDB;&#x53BB;&#xFF0C;&#x8BA9;&#x6A21;&#x5757;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x53D1;&#x5C55;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x571F;&#x58E4;&#xFF0C;&#x6210;&#x957F;&#x7A7A;&#x95F4;&#x548C;&#x7075;&#x6D3B;&#x5EA6;&#x975E;&#x5E38;&#x5927;&#x3002;<br>2.  &#x51CF;&#x5C11;&#x5404;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#x6216;&#x8005;Demo&#x7684;&#x4F53;&#x79EF;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x6A21;&#x5757;&#x4E0D;&#x4F1A;&#x7531;&#x4E8E;Common&#x7684;&#x5B58;&#x5728;&#x800C;&#x5305;&#x542B;&#x5728;&#x5185;&#x3002;<br>3.  &#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#xFF0C;&#x6A21;&#x5757;&#x5347;&#x7EA7;&#x4E4B;&#x540E;&#x8981;&#x505A;&#x7684;&#x540C;&#x6B65;&#x5DE5;&#x4F5C;&#x975E;&#x5E38;&#x8F7B;&#x677E;&#xFF0C;&#x89E3;&#x653E;&#x4E86;&#x90A3;&#x4E2A;&#x82E6;&#x903C;&#x7684;Common&#x7EF4;&#x62A4;&#x8005;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x66F4;&#x5B9E;&#x8D28;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x4E0A;&#x3002;<br>4.  &#x7B26;&#x5408;&#x7EC6;&#x7C92;&#x5EA6;&#x6A21;&#x5757;&#x5212;&#x5206;&#x7684;&#x67B6;&#x6784;&#x601D;&#x60F3;&#x3002;<br>Common&#x7684;&#x597D;&#x5904;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x5C31;&#x662F;&#x524D;&#x671F;&#x7279;&#x522B;&#x7701;&#x4E8B;&#x513F;&#x3002;&#x7136;&#x800C;&#x5B83;&#x7684;&#x574F;&#x5904;&#x6BD4;&#x597D;&#x5904;&#x8981;&#x591A;&#x592A;&#x591A;&#x3002;&#x4E0D;&#x8BBE;&#x7F6E;Common&#xFF0C;&#x518D;&#x5C0F;&#x7684;&#x6A21;&#x5757;&#x518D;&#x5C0F;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x5355;&#x72EC;&#x62CE;&#x51FA;&#x6765;&#xFF0C;&#x6700;&#x591A;&#x5C31;&#x662F;Podfile&#x91CC;&#x9762;&#x8981;&#x591A;&#x5199;&#x51E0;&#x884C;&#xFF0C;&#x591A;&#x5199;&#x51E0;&#x884C;&#x6700;&#x591A;&#x53EA;&#x82B1;&#x8D39;&#x51E0;&#x5206;&#x949F;&#x3002;&#x4F46;&#x82E5;&#x8981;&#x6D88;&#x9664;Common&#x6240;&#x5E26;&#x6765;&#x7684;&#x7F6A;&#x5B7D;&#xFF0C;&#x4E0D;&#x662F;&#x8FD9;&#x51E0;&#x5206;&#x949F;&#x5C31;&#x80FD;&#x641E;&#x5B9A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x65E2;&#x7136;&#x4E0D;&#x7528;Common&#x7684;&#x597D;&#x5904;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x90A3;&#x4F55;&#x4E50;&#x800C;&#x4E0D;&#x4E3A;&#x5462;&#xFF1F;<br><br>&#x5047;&#x8BBE;&#x5C06;&#x6765;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x662F;&#x7528;&#x6765;&#x505A;Location&#x7684;&#xFF0C;&#x54EA;&#x6015;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x7ED9;&#x4ED6;&#x5F00;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5C31;&#x53EB;Location&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x662F;&#x7528;&#x6765;&#x505A;ImageProcess&#x7684;&#xFF0C;&#x90A3;&#x4E5F;&#x5F00;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5C31;&#x53EB;ImageProcess&#x3002;&#x4E0D;&#x8981;&#x90FD;&#x653E;&#x5230;Common&#x91CC;&#x9762;&#x53BB;&#xFF0C;&#x5C06;&#x6765;&#x4F60;&#x518D;&#x5F00;&#x65B0;&#x7684;&#x9879;&#x76EE;&#x6216;&#x8005;&#x65B0;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x7528;Location&#x5C31;&#x5199;&#x4F9D;&#x8D56;Location&#xFF0C;&#x7528;ImageProcess&#x5C31;&#x5199;&#x4F9D;&#x8D56;ImageProcess&#xFF0C;&#x4E0D;&#x8981;&#x518D;&#x4F9D;&#x8D56;Common&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x4E5F;&#x597D;&#x7BA1;&#x7406;&#xFF0C;&#x7BA1;&#x7406;Common&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#x65E5;&#x5B50;&#x8FC7;&#x5F97;&#x4E5F;&#x8F7B;&#x677E;&#xFF08;&#x8FD9;&#x4E2A;&#x4EBA;&#x5176;&#x5B9E;&#x90FD;&#x53EF;&#x4EE5;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#xFF0C;&#x628A;&#x4ED6;&#x7684;&#x5DE5;&#x8D44;&#x52A0;&#x5230;&#x4F60;&#x5934;&#x4E0A;&#x4E0D;&#x662F;&#x66F4;&#x597D;&#xFF1F;:D&#xFF09;&#xFF0C;&#x5C06;&#x6765;&#x8981;&#x5347;&#x7EA7;&#xFF0C;&#x987E;&#x8651;&#x4E5F;&#x5C11;&#x3002;

</em>   &#x4E0D;&#x7528;&#x6587;&#x6863;&#xFF0C;&#x6216;&#x5F88;&#x5C11;&#x6587;&#x6863;&#xFF0C;&#x5C31;&#x80FD;&#x8BA9;&#x4E1A;&#x52A1;&#x65B9;&#x4E0A;&#x624B;<br>&#x8C01;&#x7279;&#x4E48;&#x4F1A;&#x53BB;&#x770B;&#x6587;&#x6863;&#x554A;&#xFF0C;&#x4E1A;&#x52A1;&#x65B9;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x88AB;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x903C;&#x5F97;&#x5F88;&#x5FD9;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x8BA9;&#x4F60;&#x7684;API&#x540D;&#x5B57;&#x53EF;&#x8BFB;&#x6027;&#x5F3A;&#xFF0C;&#x5BF9;&#x4E8E;iOS&#x6765;&#x8BF4;&#xFF0C;objc&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;&#x628A;&#x8FD9;&#x4E2A;&#x505A;&#x5230;&#x4E86;&#x6781;&#x81F4;&#xFF0C;&#x51FD;&#x6570;&#x540D;&#x957F;&#x5C31;&#x957F;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x8981;&#x7D27;&#x3002;<br><div><br><pre class="">&#x597D;&#x7684;&#x51FD;&#x6570;&#x540D;&#xFF1A;<br>    - (NSDictionary <em>)exifDataOfImage:(UIImage </em>)image atIndexPath:(NSIndexPath <em>)indexPath;<br><br>&#x574F;&#x7684;&#x51FD;&#x6570;&#x540D;&#xFF1A;<br>    - (id)exifData:(UIImage </em>)image position:(id)indexPath callback:(id&lt;ErrorDelegate&gt;)delegate;<br><br>&#x4E3A;&#x4EC0;&#x4E48;&#x574F;&#xFF1F;<br>    1. &#x4E0D;&#x8981;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;id&#x6216;&#x8005;&#x4F20;&#x5165;id&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x884C;&#xFF0C;&#x7528;id&lt;protocol&gt;&#x4E5F;&#x6BD4;id&#x597D;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x8FD9;&#x4E2A;&#x90FD;&#x505A;&#x4E0D;&#x5230;&#xFF0C;&#x4F60;&#x8981;&#x597D;&#x597D;&#x8003;&#x8651;&#x4F60;&#x7684;&#x67B6;&#x6784;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x95EE;&#x9898;&#x3002;<br>    2. &#x8981;&#x544A;&#x77E5;&#x4E1A;&#x52A1;&#x65B9;&#x8981;&#x4F20;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6BD4;&#x5982;&#x8981;&#x4F20;Image&#xFF0C;&#x90A3;&#x5C31;&#x5199;&#x4E0A;ofImage&#x3002;&#x5982;&#x679C;&#x8981;&#x4F20;&#x4F4D;&#x7F6E;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x5199;&#x4E0A;IndexPath&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;position&#x8FD9;&#x4E48;&#x7B3C;&#x7EDF;&#x7684;&#x4E1C;&#x897F;<br>    3. &#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7406;&#x7531;&#x8981;&#x628A;delegate&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x8FDB;&#x53BB;&#xFF0C;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0D;&#x5F97;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x3002;&#x800C;&#x4E14;delegate&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x7684;&#x5145;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x67B6;&#x6784;&#x6709;&#x95EE;&#x9898;&#xFF01;</pre><br></div>

<ul>
<li>&#x601D;&#x8DEF;&#x548C;&#x65B9;&#x6CD5;&#x8981;&#x7EDF;&#x4E00;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x591A;&#x5143;<br>&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x786E;&#x5B9A;&#x4E86;&#x4E00;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x91C7;&#x7528;&#x522B;&#x7684;&#x65B9;&#x6848;&#x4E86;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x505A;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5F97;&#x65F6;&#x523B;&#x8BB0;&#x4F4F;&#x5F53;&#x521D;&#x4F60;&#x51B3;&#x5B9A;&#x8981;&#x5904;&#x7406;&#x8FD9;&#x6837;&#x7C7B;&#x578B;&#x7684;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6848;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x4F60;&#x7684;&#x521D;&#x8877;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0D;&#x8981;&#x6447;&#x6446;&#x4E0D;&#x5B9A;&#x3002;</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4F60;&#x5F53;&#x521D;&#x8BBE;&#x7ACB;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x4E00;&#x5B9A;&#x662F;&#x6709;&#x60F3;&#x6CD5;&#x6709;&#x539F;&#x56E0;&#x7684;&#xFF0C;&#x8981;&#x8BB0;&#x5F55;&#x4E0B;&#x4F60;&#x7684;&#x89E3;&#x51B3;&#x601D;&#x8DEF;&#xFF0C;&#x4E0D;&#x8981;&#x5230;&#x65F6;&#x5019;&#x6362;&#x4E2A;&#x5730;&#x65B9;&#x4F60;&#x53C8;&#x7075;&#x5149;&#x4E00;&#x73B0;&#x5565;&#x7684;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x5176;&#x4ED6;&#x65B9;&#x6848;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x5F02;&#x6784;&#x3002;</p>
<p>&#x8981;&#x662F;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x91CC;&#x9762;&#x89E3;&#x51B3;&#x540C;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#x6709;&#x5404;&#x79CD;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x7C7B;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x505A;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x4E00;&#x5B9A;&#x662F;&#x81EA;&#x5DF1;&#x90FD;&#x6CA1;&#x60F3;&#x6E05;&#x695A;&#x5C31;&#x5F00;&#x59CB;&#x641E;&#x4E86;&#x3002;</p>
<ul>
<li>&#x6CA1;&#x6709;&#x6A2A;&#x5411;&#x4F9D;&#x8D56;&#xFF0C;&#x4E07;&#x4E0D;&#x5F97;&#x5DF2;&#x4E0D;&#x51FA;&#x73B0;&#x8DE8;&#x5C42;&#x8BBF;&#x95EE;<br>&#x6CA1;&#x6709;&#x6A2A;&#x5411;&#x4F9D;&#x8D56;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x8FD9;&#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x5C06;&#x6765;&#x8981;&#x5BF9;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x505A;&#x4FEE;&#x8865;&#x6240;&#x9700;&#x8981;&#x7684;&#x6210;&#x672C;&#x6709;&#x591A;&#x5927;&#x3002;&#x8981;&#x505A;&#x5230;&#x6CA1;&#x6709;&#x6A2A;&#x5411;&#x4F9D;&#x8D56;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x8003;&#x9A8C;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x6A21;&#x5757;&#x5206;&#x7C7B;&#x80FD;&#x529B;&#x548C;&#x662F;&#x5426;&#x719F;&#x6089;&#x4E1A;&#x52A1;&#x7684;&#x3002;</li>
</ul>
<p>&#x8DE8;&#x5C42;&#x8BBF;&#x95EE;&#x662F;&#x6307;&#x6570;&#x636E;&#x6D41;&#x5411;&#x4E86;&#x8DDF;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x5BF9;&#x63A5;&#x5173;&#x7CFB;&#x7684;&#x6A21;&#x5757;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x8DE8;&#x5C42;&#x8BBF;&#x95EE;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x7F51;&#x7EDC;&#x5E95;&#x5C42;&#x91CC;&#x9762;&#x4FE1;&#x53F7;&#x4ECE;2G&#x53D8;&#x6210;&#x4E86;3G&#x53D8;&#x6210;&#x4E86;4G&#xFF0C;&#x8FD9;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8DE8;&#x5C42;&#x901A;&#x77E5;&#x5230;View&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x591A;&#xFF0C;&#x4E00;&#x65E6;&#x51FA;&#x73B0;&#x5C31;&#x8981;&#x60F3;&#x5C3D;&#x4E00;&#x5207;&#x529E;&#x6CD5;&#x5728;&#x672C;&#x5C42;&#x641E;&#x5B9A;&#x6216;&#x8005;&#x4EA4;&#x7ED9;&#x4E0A;&#x5C42;&#x6216;&#x8005;&#x4E0B;&#x5C42;&#x641E;&#x5B9A;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x51FA;&#x73B0;&#x8DE8;&#x5C42;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8DE8;&#x5C42;&#x8BBF;&#x95EE;&#x540C;&#x6837;&#x4E5F;&#x4F1A;&#x589E;&#x52A0;&#x8026;&#x5408;&#x5EA6;&#xFF0C;&#x5F53;&#x67D0;&#x4E00;&#x5C42;&#x9700;&#x8981;&#x6574;&#x4F53;&#x66FF;&#x6362;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7275;&#x6D89;&#x9762;&#x5C31;&#x4F1A;&#x5F88;&#x5927;&#x3002;</p>
<ul>
<li>&#x5BF9;&#x4E1A;&#x52A1;&#x65B9;&#x8BE5;&#x9650;&#x5236;&#x7684;&#x5730;&#x65B9;&#x6709;&#x9650;&#x5236;&#xFF0C;&#x8BE5;&#x7075;&#x6D3B;&#x7684;&#x5730;&#x65B9;&#x8981;&#x7ED9;&#x4E1A;&#x52A1;&#x65B9;&#x521B;&#x9020;&#x7075;&#x6D3B;&#x5B9E;&#x73B0;&#x7684;&#x6761;&#x4EF6;<br>&#x628A;&#x8FD9;&#x70B9;&#x505A;&#x597D;&#xFF0C;&#x5F88;&#x4F9D;&#x8D56;&#x4E8E;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x67B6;&#x6784;&#x5E08;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x80FD;&#x529B;&#x533A;&#x5206;&#x54EA;&#x4E9B;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x9650;&#x5236;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x54EA;&#x4E9B;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x521B;&#x9020;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;Core Data&#x6280;&#x672F;&#x6808;&#x6765;&#x8BF4;&#xFF0C;ManagedObject&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x53EF;&#x4EE5;&#x51FA;&#x73B0;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;ManagedObject&#xFF0C;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;ManagedObjectContext&#x5728;&#x540C;&#x6B65;&#x4FEE;&#x6539;&#x7684;&#x65F6;&#x5019;&#x628A;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x6765;&#x6E90;&#x7684;&#x4FEE;&#x6539;&#x540C;&#x6B65;&#x8FDB;&#x53BB;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x9650;&#x5236;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x53EA;&#x5BF9;&#x5916;&#x516C;&#x5F00;&#x4E00;&#x4E2A;&#x4FEE;&#x6539;&#x63A5;&#x53E3;&#xFF0C;&#x4E0D;&#x66B4;&#x9732;&#x4EFB;&#x4F55;ManagedObject&#x5728;&#x5916;&#x9762;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x662F;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;ABTest&#x76F8;&#x5173;&#x7684;API&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x5E0C;&#x671B;&#x589E;&#x52A0;&#x5B83;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x4F7F;&#x5F97;&#x4E1A;&#x52A1;&#x65B9;&#x4E0D;&#x5149;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Target-Action&#x7684;&#x6A21;&#x5F0F;&#x5B9E;&#x73B0;ABtest&#xFF0C;&#x4E5F;&#x8981;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Block&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;ABTest&#xFF0C;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x6EE1;&#x8DB3;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x51CF;&#x5C11;&#x4E1A;&#x52A1;&#x65B9;&#x7684;&#x4F7F;&#x7528;&#x6210;&#x672C;&#x3002;</p>
<ul>
<li><p>&#x6613;&#x6D4B;&#x8BD5;&#x6613;&#x62D3;&#x5C55;<br>&#x8001;&#x751F;&#x5E38;&#x8C08;&#xFF0C;&#x8981;&#x5B9E;&#x73B0;&#x6613;&#x6D4B;&#x8BD5;&#x6613;&#x62D3;&#x5C55;&#xFF0C;&#x90A3;&#x5C31;&#x8981;&#x63D0;&#x9AD8;&#x6A21;&#x5757;&#x5316;&#x7A0B;&#x5EA6;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x51CF;&#x5C11;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x4FBF;&#x4E8E;mock&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x9AD8;&#x5EA6;&#x6A21;&#x5757;&#x5316;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x62D3;&#x5C55;&#x8D77;&#x6765;&#x5C06;&#x4F1A;&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
</li>
<li><p>&#x4FDD;&#x6301;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x8D85;&#x524D;&#x6027;<br>&#x8FD9;&#x4E00;&#x70B9;&#x80FD;&#x770B;&#x51FA;&#x67B6;&#x6784;&#x5E08;&#x662F;&#x5426;&#x5173;&#x6CE8;&#x884C;&#x4E1A;&#x52A8;&#x6001;&#xFF0C;&#x662F;&#x5426;&#x80FD;&#x51C6;&#x786E;&#x628A;&#x63E1;&#x6280;&#x672F;&#x8D70;&#x5411;&#x3002;&#x4FDD;&#x6301;&#x9002;&#x5EA6;&#x7684;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x8D85;&#x524D;&#x6027;&#xFF0C;&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x67B6;&#x6784;&#x66F4;&#x65B0;&#x53D8;&#x5F97;&#x76F8;&#x5BF9;&#x8F7B;&#x677E;&#x3002;</p>
</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x8D85;&#x524D;&#x6027;&#x4E5F;&#x4E0D;&#x5149;&#x662F;&#x6280;&#x672F;&#x4E0A;&#x7684;&#xFF0C;&#x8FD8;&#x6709;&#x4EA7;&#x54C1;&#x4E0A;&#x7684;&#x3002;&#x8C01;&#x8BF4;&#x67B6;&#x6784;&#x5E08;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x8DDF;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x6253;&#x4EA4;&#x9053;&#x4E86;&#xFF0C;&#x6CA1;&#x4E8B;&#x591A;&#x8DDF;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x804A;&#x804A;&#x5929;&#xFF0C;&#x542C;&#x542C;&#x4ED6;&#x5BF9;&#x4EA7;&#x54C1;&#x672A;&#x6765;&#x8D70;&#x5411;&#x7684;&#x7545;&#x60F3;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x5408;&#x7406;&#x7684;&#x5730;&#x65B9;&#x4E3A;&#x4ED6;&#x7684;&#x7545;&#x60F3;&#x7559;&#x4E00;&#x6761;&#x8DEF;&#x5B50;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5F88;&#x591A;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#x5176;&#x5B9E;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x8D76;&#x4EA7;&#x54C1;&#x8FDB;&#x5EA6;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x59A5;&#x534F;&#x65B9;&#x6848;&#xFF0C;&#x6700;&#x540E;&#x8FD8;&#x662F;&#x4F1A;&#x8F6C;&#x5230;&#x6B63;&#x8F68;&#x7684;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x4E1A;&#x52A1;&#x65B9;&#x53EF;&#x4EE5;&#x4E0D;&#x5B9E;&#x73B0;&#x8F6C;&#x5230;&#x6B63;&#x89C4;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x67B6;&#x6784;&#x8FD9;&#x8FB9;&#xFF0C;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x4E3A;&#x8FD9;&#x79CD;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x6539;&#x53D8;&#x505A;&#x51C6;&#x5907;&#x7684;&#x3002;</p>
<ul>
<li><p>&#x63A5;&#x53E3;&#x5C11;&#xFF0C;&#x63A5;&#x53E3;&#x53C2;&#x6570;&#x5C11;<br>&#x8D8A;&#x5C11;&#x7684;&#x63A5;&#x53E3;&#x8D8A;&#x5C11;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x80FD;&#x8D8A;&#x964D;&#x4F4E;&#x4E1A;&#x52A1;&#x65B9;&#x7684;&#x4F7F;&#x7528;&#x6210;&#x672C;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x8FD8;&#x662F;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x6EE1;&#x8DB3;&#x5145;&#x8981;&#x6761;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x51CF;&#x5C11;&#x63A5;&#x53E3;&#x548C;&#x53C2;&#x6570;&#x6570;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x80FD;&#x770B;&#x51FA;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x529F;&#x529B;&#x6709;&#x591A;&#x6DF1;&#x539A;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x9AD8;&#x6027;&#x80FD;<br>&#x4E3A;&#x4EC0;&#x4E48;&#x9AD8;&#x6027;&#x80FD;&#x6392;&#x5728;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#xFF1F;</p>
</li>
</ul>
<p>&#x9AD8;&#x6027;&#x80FD;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x8003;&#x8651;&#x56E0;&#x7D20;&#x3002;&#x539F;&#x56E0;&#x6709;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x4E1A;&#x52A1;&#x53D8;&#x5316;&#x975E;&#x5E38;&#x4E4B;&#x5FEB;&#xFF0C;&#x505A;&#x67B6;&#x6784;&#x65F6;&#x9996;&#x8981;&#x8003;&#x8651;&#x56E0;&#x7D20;&#x5E94;&#x5F53;&#x662F;&#x4FBF;&#x4E8E;&#x4E1A;&#x52A1;&#x65B9;&#x5FEB;&#x901F;&#x6EE1;&#x8DB3;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x63D0;&#x4F9B;&#x7B80;&#x5355;&#x6613;&#x7528;&#x6548;&#x679C;&#x597D;&#x7684;&#x63A5;&#x53E3;&#x7ED9;&#x4E1A;&#x52A1;&#x65B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x63D0;&#x4F9B;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x63A5;&#x53E3;&#x7ED9;&#x4E1A;&#x52A1;&#x65B9;&#x3002;</li>
<li>&#x82F9;&#x679C;&#x5E73;&#x53F0;&#x7684;&#x6027;&#x80FD;&#x975E;&#x5E38;&#x4E4B;&#x68D2;&#xFF0C;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x5F88;&#x5C11;&#x4F1A;&#x51FA;&#x73B0;&#x7531;&#x4E8E;&#x6027;&#x80FD;&#x4E0D;&#x591F;&#x5BFC;&#x81F4;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x82F9;&#x679C;&#x5E73;&#x53F0;&#x7684;&#x4F18;&#x5316;&#x624B;&#x6BB5;&#x76F8;&#x5BF9;&#x6709;&#x9650;&#xFF0C;&#x751A;&#x81F3;&#x4E8E;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x5373;&#x4FBF;&#x52A8;&#x7528;&#x4E86;&#x65E0;&#x6240;&#x4E0D;&#x7528;&#x5176;&#x6781;&#x7684;&#x624B;&#x6BB5;&#x4E43;&#x81F3;&#x4E0D;&#x62E9;&#x624B;&#x6BB5;&#x727A;&#x7272;&#x4E86;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x6027;&#x80FD;&#x63D0;&#x9AD8;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4E5F;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;100ms&#x5230;90ms&#x7684;&#x5DEE;&#x8DDD;&#x3002;10%&#x7684;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x7AEF;&#x6765;&#x8BF4;&#x5F88;&#x4E0D;&#x9519;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x7AEF;&#x52A8;&#x4E0D;&#x52A8;&#x5C31;&#x662F;&#x51E0;&#x5341;&#x4E07;&#x4E0A;&#x767E;&#x4E07;&#x7684;&#x8BBF;&#x95EE;&#x91CF;&#xFF0C;&#x51E0;&#x5341;&#x4E07;&#x4E0A;&#x767E;&#x4E07;&#x4E2A;10ms&#x662F;&#x5F88;&#x53EF;&#x89C2;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x65E0;&#x6CD5;&#x611F;&#x77E5;&#x8FD9;10ms&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x4ECE;10s&#x4F18;&#x5316;&#x6210;9s&#x7528;&#x6237;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x611F;&#x77E5;&#x7684;&#xFF0C;&#x4F46;&#x662F;100ms&#x53D8;90ms&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5427;&#xFF0C;&#x8FD8;&#x662F;&#x522B;&#x6298;&#x817E;&#x4E86;&#x3002;<br>&#x4F46;&#x662F;&#xFF01;&#x4E0D;&#x91CD;&#x8981;&#x4E0D;&#x4EE3;&#x8868;&#x7528;&#x4E0D;&#x7740;&#x53BB;&#x505A;&#xFF0C;&#x5173;&#x4E8E;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4F1A;&#x5BF9;&#x5E94;&#x653E;&#x5230;&#x5404;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#x53BB;&#x3002;&#x6BD4;&#x5982;&#x7F51;&#x7EDC;&#x5C42;&#x4F18;&#x5316;&#xFF0C;&#x90A3;&#x5C31;&#x4F1A;&#x5728;&#x7F51;&#x7EDC;&#x5C42;&#x65B9;&#x6848;&#x7684;&#x90A3;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#x53BB;&#x5199;&#xFF0C;&#x5BF9;&#x5E94;&#x6BCF;&#x5C42;&#x67B6;&#x6784;&#x90FD;&#x6709;&#x6BCF;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x4E0D;&#x540C;&#x4F18;&#x5316;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x5728;&#x5404;&#x81EA;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#x4E00;&#x4E00;&#x7EC6;&#x8BF4;&#x3002;</li>
</ul>
<p>&#xA0;</p>
<blockquote>
<p>&#x5176;&#x5B9E;&#x5206;&#x5C42;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x771F;&#x6CA1;&#x5565;&#x6280;&#x672F;&#x542B;&#x91CF;&#xFF0C;&#x5168;&#x51ED;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x7D20;&#x8D28;&#x3002;<br>&#xA0;</p>
</blockquote>
<h1 id="&#x67B6;&#x6784;&#x4E4B;&#x5206;&#x5C42;"><a href="#&#x67B6;&#x6784;&#x4E4B;&#x5206;&#x5C42;" class="headerlink" title="&#x67B6;&#x6784;&#x4E4B;&#x5206;&#x5C42;"></a>&#x67B6;&#x6784;&#x4E4B;&#x5206;&#x5C42;</h1><p>&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;&#x5206;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x6709;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x7684;&#xFF1A;&#x5C55;&#x73B0;&#x5C42;&#x3001;&#x4E1A;&#x52A1;&#x5C42;&#x3001;&#x6570;&#x636E;&#x5C42;&#x3002;&#x4E5F;&#x6709;&#x56DB;&#x5C42;&#x67B6;&#x6784;&#x7684;&#xFF1A;&#x5C55;&#x73B0;&#x5C42;&#x3001;&#x4E1A;&#x52A1;&#x5C42;&#x3001;&#x7F51;&#x7EDC;&#x5C42;&#x3001;&#x672C;&#x5730;&#x6570;&#x636E;&#x5C42;&#x3002;&#x8FD9;&#x91CC;&#x8BF4;&#x4E09;&#x5C42;&#x3001;&#x56DB;&#x5C42;&#xFF0C;&#x8DDF;TCP/IP&#x6240;&#x8C13;&#x7684;&#x4E94;&#x5C42;&#x6216;&#x8005;&#x4E03;&#x5C42;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x79CD;&#x6982;&#x5FF5;&#x3002;&#x518D;&#x5177;&#x4F53;&#x8BF4;&#x5C31;&#x662F;&#xFF1A;&#x4F60;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x5728;&#x903B;&#x8F91;&#x4E0A;&#x662F;&#x51E0;&#x5C42;&#x90A3;&#x5C31;&#x51E0;&#x5C42;&#xFF0C;&#x5177;&#x4F53;&#x6BCF;&#x4E00;&#x5C42;&#x53EB;&#x4EC0;&#x4E48;&#xFF0C;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x6CA1;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x89C4;&#x8303;&#x3002;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x9488;&#x5BF9;&#x6A21;&#x5757;&#x5206;&#x7C7B;&#x800C;&#x8A00;&#x7684;&#x3002;</p>
<p>&#x4E5F;&#x6709;&#x8BF4;MVC&#x67B6;&#x6784;&#xFF0C;MVVM&#x67B6;&#x6784;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x5C42;&#x6B21;&#x5212;&#x5206;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x6D41;&#x52A8;&#x7684;&#x65B9;&#x5411;&#x800C;&#x8A00;&#x7684;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x6D41;&#x52A8;&#x65B9;&#x5411;&#x505A;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x9488;&#x5BF9;&#x6A21;&#x5757;&#x5206;&#x7C7B;&#x505A;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x4F1A;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;MVC&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x662F;&#x56DB;&#x5C42;&#xFF1A;&#x5C55;&#x73B0;&#x5C42;&#x3001;&#x4E1A;&#x52A1;&#x5C42;&#x3001;&#x7F51;&#x7EDC;&#x5C42;&#x3001;&#x672C;&#x5730;&#x6570;&#x636E;&#x5C42;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8981;&#x8BF4;&#x8FD9;&#x4E2A;&#xFF1F;</p>
<p>&#x5927;&#x6982;&#x5728;&#x4E94;&#x516D;&#x5E74;&#x524D;&#xFF0C;&#x4E1A;&#x754C;&#x5F88;&#x6D41;&#x884C;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x3002;&#x7136;&#x540E;&#x5404;&#x79CD;&#x6587;&#x6863;&#x8D44;&#x6599;&#x6F2B;&#x5929;&#x7684;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x5E76;&#x4E14;&#x559C;&#x6B22;&#x628A;&#x5B83;&#x4E0E;MVC&#x653E;&#x5728;&#x4E00;&#x8D77;&#x8BF4;&#xFF0C;MVC&#x4E09;&#x5C42;&#x67B6;&#x6784;/&#x4E09;&#x5C42;&#x67B6;&#x6784;MVC&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x4F1A;&#x8BA4;&#x4E3A;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x5C31;&#x662F;MVC&#xFF0C;MVC&#x5C31;&#x662F;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x3002;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x7684;&#x3002;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x91CC;&#x9762;&#x5176;&#x5B9E;&#x6CA1;&#x6709;Controller&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x4E14;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x63CF;&#x8FF0;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#x662F;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x3002;MVC&#x6709;Controller&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5B83;&#x63CF;&#x8FF0;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x6570;&#x636E;&#x6D41;&#x52A8;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x597D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6D41;&#x884C;&#x8D77;&#x6765;&#x7684;&#x662F;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x56DB;&#x5C42;&#x67B6;&#x6784;&#x6216;&#x4E94;&#x5C42;&#x67B6;&#x6784;&#xFF1F;</p>
<p>&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x6A21;&#x5757;&#x89D2;&#x8272;&#x53EA;&#x4F1A;&#x6709;&#x4E09;&#x79CD;&#xFF1A;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x8005;&#x3001;&#x6570;&#x636E;&#x52A0;&#x5DE5;&#x8005;&#x3001;&#x6570;&#x636E;&#x5C55;&#x793A;&#x8005;&#xFF0C;&#x610F;&#x601D;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x7B3C;&#x7EDF;&#x8BF4;&#x6765;&#xFF0C;&#x8F6F;&#x4EF6;&#x53EA;&#x4F1A;&#x6709;&#x4E09;&#x5C42;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x626E;&#x6F14;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x7B2C;&#x56DB;&#x5C42;&#x7B2C;&#x4E94;&#x5C42;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x8FD9;&#x4E09;&#x5C42;&#x91CC;&#x9762;&#x7684;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x5206;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x90FD;&#x80FD;&#x5F52;&#x7EB3;&#x8FDB;&#x8FD9;&#x4E09;&#x5C42;&#x7684;&#x67D0;&#x4E00;&#x5C42;&#x4E2D;&#x53BB;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x6765;&#x63CF;&#x8FF0;&#x5C31;&#x6BD4;&#x8F83;&#x666E;&#x904D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x505A;&#x5206;&#x5C42;&#xFF1F;</p>
<p>&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x505A;&#x5206;&#x5C42;&#xFF0C;&#x4E0D;&#x662F;&#x5728;&#x505A;&#x67B6;&#x6784;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x8981;&#x6309;&#x7167;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#x6765;&#x8BBE;&#x8BA1;&#x67B6;&#x6784;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x9002;&#x5408;&#x76F4;&#x63A5;&#x4ECE;&#x4E09;&#x5C42;&#x5F00;&#x59CB;&#x3002;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x5148;&#x786E;&#x5B9A;&#x6240;&#x6709;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5148;&#x786E;&#x5B9A;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x6A21;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x518D;&#x5F80;&#x4E0B;&#x7EC6;&#x5316;&#x8BBE;&#x8BA1;&#x3002;&#x7136;&#x540E;&#x518D;&#x628A;&#x8FD9;&#x4E9B;&#x5217;&#x51FA;&#x6765;&#x7684;&#x95EE;&#x9898;&#x548C;&#x6A21;&#x5757;&#x505A;&#x597D;&#x5206;&#x7C7B;&#x3002;&#x5206;&#x7C7B;&#x4E4B;&#x540E;&#x4E0D;&#x51FA;&#x610F;&#x5916;&#x5927;&#x591A;&#x6570;&#x90FD;&#x662F;&#x4E09;&#x5C42;&#x3002;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x67D0;&#x4E00;&#x5C42;&#x7279;&#x522B;&#x5E9E;&#x5927;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x518D;&#x62C6;&#x5F00;&#x6765;&#x53D8;&#x6210;&#x56DB;&#x5C42;&#xFF0C;&#x53D8;&#x6210;&#x4E94;&#x5C42;&#x3002;</p>
<hr>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x4F60;&#x8981;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x5373;&#x65F6;&#x901A;&#x8BAF;&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x67B6;&#x6784;&#xFF0C;&#x600E;&#x4E48;&#x5206;&#x5C42;&#xFF1F;</p>
<p>&#x8BB0;&#x4F4F;&#xFF0C;&#x4E0D;&#x8981;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x628A;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x89C4;&#x8303;&#x5957;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x505A;&#x4E0D;&#x51FA;&#x597D;&#x67B6;&#x6784;&#x7684;&#x3002;</p>
<p>&#x4F60;&#x8981;&#x5148;&#x786E;&#x5B9A;&#x90FD;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x4E3E;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x968F;&#x610F;&#x5217;&#x51FA;&#x4E00;&#x70B9;&#x610F;&#x601D;&#x610F;&#x601D;&#x5C31;&#x597D;&#x4E86;&#xFF1A;</p>
<ol>
<li>&#x8981;&#x89E3;&#x51B3;&#x7528;&#x6237;&#x767B;&#x5F55;&#x3001;&#x9000;&#x51FA;&#x7684;&#x95EE;&#x9898;</li>
<li>&#x89E3;&#x51B3;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x95F4;&#x6570;&#x636E;&#x4EA4;&#x6D41;&#x7684;&#x95EE;&#x9898;</li>
<li>&#x89E3;&#x51B3;&#x7528;&#x6237;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x95EE;&#x9898;</li>
<li>&#x5982;&#x679C;&#x662F;&#x591A;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x5C31;&#x8981;&#x89E3;&#x51B3;&#x7528;&#x6237;&#x8FDE;&#x63A5;&#x7684;&#x5BFB;&#x5740;&#x95EE;&#x9898;<br>&#x89E3;&#x51B3;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x7BA1;&#x7406;&#x6A21;&#x5757;&#xFF0C;&#x94FE;&#x63A5;&#x7BA1;&#x7406;&#x6A21;&#x5757;&#x4E00;&#x822C;&#x662F;&#x901A;&#x8FC7;&#x94FE;&#x63A5;&#x6C60;&#x6765;&#x5B9E;&#x73B0;&#x3002; &#x89E3;&#x51B3;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x6A21;&#x5757;&#xFF0C;&#x4ECE;A&#x63A5;&#x6536;&#x6765;&#x7684;&#x6570;&#x636E;&#x8981;&#x7ED9;&#x5230;B&#xFF0C;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7531;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x6765;&#x505A;&#x3002; &#x89E3;&#x51B3;&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x9700;&#x8981;&#x6709;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x670D;&#x52A1;&#x4E8E;&#x5927;&#x91CF;&#x7528;&#x6237;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x91CF;&#x65F6;&#x624D;&#x6267;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x3002; &#x89E3;&#x51B3;&#x7B2C;&#x56DB;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x6709;&#x51E0;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x96C6;&#x7FA4;&#x4E2D;&#x6709;&#x90A3;&#x4E48;&#x51E0;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4F5C;&#x4E3A;&#x5BFB;&#x8DEF;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6240;&#x6709;&#x5BFB;&#x8DEF;&#x7684;&#x670D;&#x52A1;&#x4EA4;&#x7ED9;&#x90A3;&#x51E0;&#x53F0;&#x53BB;&#x505A;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9700;&#x8981;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x5BFB;&#x8DEF;&#x670D;&#x52A1;&#x7684;Daemon&#x3002;&#x6216;&#x8005;&#x7528;&#x5E7F;&#x64AD;&#x65B9;&#x5F0F;&#x5BFB;&#x8DEF;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5BFB;&#x8DEF;&#x9891;&#x6B21;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x96C6;&#x7FA4;&#x5185;&#x90E8;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#x7279;&#x522B;&#x5927;&#x3002;&#x8FD9;&#x662F;&#x4F60;&#x8981;&#x6743;&#x8861;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x76EE;&#x524D;&#x6D41;&#x884C;&#x7684;&#x601D;&#x8DEF;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x8981;&#x89E3;&#x51B3;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x914D;&#x7F6E;&#x4E00;&#x4E2A;&#x7F13;&#x5B58;&#x3002;</li>
</ol>
<p>&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#xFF1A;</p>
<p>&#x94FE;&#x63A5;&#x7BA1;&#x7406;&#x3001;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x3001;&#x6570;&#x636E;&#x5E93;&#x53CA;&#x5176;&#x914D;&#x5957;&#x6A21;&#x5757;&#x3001;&#x5BFB;&#x8DEF;&#x6A21;&#x5757;</p>
<p>&#x505A;&#x5230;&#x8FD9;&#x91CC;&#x8FD8;&#x8FDC;&#x8FDC;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x4F60;&#x8981;&#x7EE7;&#x7EED;&#x9488;&#x5BF9;&#x8FD9;&#x56DB;&#x4E2A;&#x6A21;&#x5757;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x7EC6;&#x5206;&#xFF0C;&#x76F4;&#x5230;&#x8DB3;&#x591F;&#x5C0F;&#x4E3A;&#x6B62;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x4E3E;&#x4F8B;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x4E0D;&#x5F80;&#x4E0B;&#x6DF1;&#x7A76;&#x4E86;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x8981;&#x63D0;&#x9192;&#x4F60;&#x7684;&#x662F;&#xFF0C;&#x76F4;&#x5230;&#x8FD9;&#x65F6;&#xFF0C;&#x8FD8;&#x662F;&#x8DDF;&#x51E0;&#x5C42;&#x67B6;&#x6784;&#x6BEB;&#x65E0;&#x5173;&#x7CFB;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x628A;&#x6240;&#x6709;&#x6A21;&#x5757;&#x90FD;&#x627E;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x8981;&#x5F00;&#x59CB;&#x6574;&#x7406;&#x4F60;&#x7684;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x67B6;&#x6784;&#x56FE;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><div></div></p>
<p><pre class="">    &#x94FE;&#x63A5;&#x7BA1;&#x7406;  &#x6536;&#x53D1;&#x6570;&#x636E;                     &#x6536;&#x53D1;&#x6570;&#x636E;<br>        &#x6570;&#x636E;&#x4EA4;&#x6362;                       /        \<br>                            \   &#x94FE;&#x63A5;&#x7BA1;&#x7406;        &#x6570;&#x636E;&#x4EA4;&#x6362;<br>    &#x5BFB;&#x8DEF;&#x670D;&#x52A1;          ========\                   /  \<br>                    ========/            &#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;   &#x5BFB;&#x8DEF;&#x670D;&#x52A1;<br>        &#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;           /<br></pre><br><br>&#x7136;&#x540E;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x5206;&#x5B8C;&#x4E4B;&#x540E;&#x4F60;&#x770B;&#x4E00;&#x4E0B;&#x56FE;&#xFF0C;&#x55EF;&#xFF0C;1&#x3001;2&#x3001;3&#xFF0C;&#x4E00;&#x5171;&#x4E09;&#x5C42;&#xFF0C;&#x6240;&#x4EE5;&#x90A3;&#x5C31;&#x662F;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x5566;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x6700;&#x6D88;&#x8017;&#x8111;&#x529B;&#x6700;&#x8003;&#x9A8C;&#x67B6;&#x6784;&#x5E08;&#x529F;&#x529B;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x5728;&#x4E8E;&#xFF1A;&#x627E;&#x5230;&#x6240;&#x6709;&#x9700;&#x8981;&#x7684;&#x6A21;&#x5757;, &#x628A;&#x6A21;&#x5757;&#x653E;&#x5728;&#x8BE5;&#x653E;&#x7684;&#x5730;&#x65B9;</p>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4FA7;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x5982;&#x4F55;&#x5206;&#x5C42;&#xFF0C;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x3001;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x89C4;&#x8303;&#x548C;&#x5305;&#x534F;&#x8BAE;&#x3001;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7B49;&#x5176;&#x4ED6;&#x4E00;&#x7CFB;&#x5217;&#x5FC5;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x6CA1;&#x6709;&#x653E;&#x8FDB;&#x53BB;&#xFF0C;&#x4F46;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x76F8;&#x4FE1;&#x4F60;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x67B6;&#x6784;&#x5E08;&#x662F;&#x600E;&#x4E48;&#x5BF9;&#x5F85;&#x5206;&#x5C42;&#x95EE;&#x9898;&#x7684;&#x4E86;&#x5427;&#xFF1F;</p>
<blockquote>
<p>&#x5BF9;&#x7684;&#xFF0C;&#x7B54;&#x6848;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x5206;&#x5C42;&#x3002;&#x6240;&#x8C13;&#x7684;&#x5206;&#x5C42;&#x90FD;&#x662F;&#x51FA;&#x67B6;&#x6784;&#x56FE;&#x4E4B;&#x540E;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x770B;&#x522B;&#x7684;&#x67B6;&#x6784;&#x5E08;&#x5728;&#x6F14;&#x8BB2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0A;&#x6765;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x5DEE;&#x4E0D;&#x591A;&#x90FD;&#x662F;&#xFF1A;&#x201D;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x5C42;&#x2026;&#x201D;&#x3002;&#x4F46;&#x8003;&#x8651;&#x5206;&#x5C42;&#x7684;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x673A;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x8003;&#x8651;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6A21;&#x5757;&#x4E00;&#x5B9A;&#x8981;&#x628A;&#x5B83;&#x8BBE;&#x8BA1;&#x5F97;&#x72EC;&#x7ACB;&#x6027;&#x5F3A;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x95E8;&#x827A;&#x672F;&#x6D3B;&#x3002;<br>&#x53E6;&#x5916;&#xFF0C;&#x8FD9;&#x867D;&#x7136;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x67B6;&#x6784;&#xFF0C;&#x4F46;&#x662F;&#x601D;&#x8DEF;&#x8DDF;&#x5BA2;&#x6237;&#x7AEF;&#x67B6;&#x6784;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4FA7;&#x91CD;&#x70B9;&#x4E0D;&#x540C;&#x7F62;&#x4E86;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x62FF;&#x5BA2;&#x6237;&#x7AEF;&#x67B6;&#x6784;&#x4E3E;&#x4F8B;&#x5B50;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x67B6;&#x6784;&#x82F9;&#x679C;&#x5DF2;&#x7ECF;&#x5E2E;&#x4F60;&#x505A;&#x597D;&#x4E86;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x4E8B;&#x60C5;&#xFF0C;&#x6CA1;&#x5269;&#x4E0B;&#x4EC0;&#x4E48;&#x503C;&#x5F97;&#x8BF4;&#x7684;&#x4E86;&#x3002;</p>
</blockquote>
<h1 id="&#x7ED3;&#x675F;"><a href="#&#x7ED3;&#x675F;" class="headerlink" title="&#x7ED3;&#x675F;"></a>&#x7ED3;&#x675F;</h1><p>&#x4E00;&#x4E0B;&#x5B50;&#x6316;&#x4E86;&#x4E2A;&#x5927;&#x5751;&#xFF0C;&#x5728;&#x5F00;&#x7BC7;&#x91CC;&#x626F;&#x4E86;&#x4E00;&#x4E9B;&#x6DE1;&#x3002;</p>
<p>&#x55EF;&#xFF0C;&#x5E72;&#x8D27;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x7684;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x91CC;&#x9762;&#x6251;&#x9762;&#x800C;&#x6765;&#x7684;&#xFF01;</p>
<p>&#xA0;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/11/10/ios-e4-b8-ad-e9-9b-86-e5-90-88-e9-81-8d-e5-8e-86-e6-96-b9-e6-b3-95-e7-9a-84-e6-af-94-e8-be-83-e5-92-8c-e6-8e-a8-e8-8d-90/" rel="next" title="ios中集合遍历方法的比较和推荐">
                <i class="fa fa-chevron-left"></i> ios中集合遍历方法的比较和推荐
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/12/07/e8-b0-88-e8-b0-88uiview-e7-9a-84-e5-87-a0-e4-b8-aalayout-e6-96-b9-e6-b3-95-layoutsubviews-e3-80-81layoutifneeded-e3-80-81setneedslayout/" rel="prev" title="谈谈UIView的几个layout方法-layoutSubviews、layoutIfNeeded、setNeedsLayout...">
                谈谈UIView的几个layout方法-layoutSubviews、layoutIfNeeded、setNeedsLayout... <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="BirdMichael" />
          <p class="site-author-name" itemprop="name">BirdMichael</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">62</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">85</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#缘由"><span class="nav-number">1.</span> <span class="nav-text">缘由</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#客户端应用架构？"><span class="nav-number">2.</span> <span class="nav-text">客户端应用架构？</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#架构之分层"><span class="nav-number">3.</span> <span class="nav-text">架构之分层</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#结束"><span class="nav-number">4.</span> <span class="nav-text">结束</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">BirdMichael</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  

  

  

  

</body>
</html>
