<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="initialize,load,初始化," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;IOS&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x7EDD;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x65F6;&amp;#x5019;&amp;#x4F60;&amp;#x90FD;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x5173;&amp;#x5FC3;&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x66">
<meta property="og:type" content="article">
<meta property="og:title" content="Objective-C 类的加载和初始化(+load 和 +initialize 方法)">
<meta property="og:url" content="http://yoursite.com/2015/08/05/loading-and-initialization-of-the-objective-c-class-load-and-initialize/index.html">
<meta property="og:site_name" content="BirdMichael">
<meta property="og:description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;IOS&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x7EDD;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x65F6;&amp;#x5019;&amp;#x4F60;&amp;#x90FD;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x5173;&amp;#x5FC3;&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x66">
<meta property="og:updated_time" content="2016-07-25T06:30:02.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Objective-C 类的加载和初始化(+load 和 +initialize 方法)">
<meta name="twitter:description" content="&amp;#x4F5C;&amp;#x4E3A;&amp;#x4E00;&amp;#x4E2A;IOS&amp;#x7A0B;&amp;#x5E8F;&amp;#x5458;&amp;#xFF0C;&amp;#x7EDD;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x65F6;&amp;#x5019;&amp;#x4F60;&amp;#x90FD;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x5173;&amp;#x5FC3;&amp;#x4E00;&amp;#x4E2A;&amp;#x7C7B;&amp;#x66">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2015/08/05/loading-and-initialization-of-the-objective-c-class-load-and-initialize/"/>

  <title> Objective-C 类的加载和初始化(+load 和 +initialize 方法) | BirdMichael </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">BirdMichael</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Objective-C 类的加载和初始化(+load 和 +initialize 方法)
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-08-05T22:13:40+08:00" content="2015-08-05">
              2015-08-05
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/OC/" itemprop="url" rel="index">
                    <span itemprop="name">OC</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;IOS&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x4F60;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x4E00;&#x4E2A;&#x7C7B;&#x662F;&#x600E;&#x4E48;&#x88AB;&#x52A0;&#x8F7D;&#x8FDB;&#x5185;&#x5B58;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x9762; runtime linker &#x5728;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x8FD8;&#x6CA1;&#x8DD1;&#x8D77;&#x6765;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x590D;&#x6742;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x7C7B;&#x6765;&#x8BF4;&#xFF0C;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x70B9;&#x5C31;&#x5DF2;&#x7ECF;&#x76F8;&#x5F53;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x7C7B;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x8868;&#xFF0C;&#x4ECE; UserDefaults &#x91CC;&#x9762;&#x8BFB;&#x53D6;&#x914D;&#x7F6E;&#x5E76;&#x7F13;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x505A;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>ObjC &#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF1A;</p>
<p><pre class="lang:objc decode:true">+ (void)initialize</pre></p>
<ul>
<li>(void)load<a id="more"></a>
</li>
</ul>
<h2 id="load"><a href="#load" class="headerlink" title="+load"></a>+load</h2><p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x7C7B;&#x5B9E;&#x73B0;&#x4E86; +load &#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x4F1A;&#x5728;&#x7C7B;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x4E2A;&#x8C03;&#x7528;&#x65F6;&#x673A;&#x662F;&#x5F88;&#x65E9;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x5728;&#x88AB;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x5F15;&#x7528;&#x7684;&#x5E94;&#x7528;&#xFF08;Application&#xFF09;&#x6216;&#x6846;&#x67B6;&#xFF08;Framework&#xFF09;&#x91CC;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x751A;&#x81F3;&#x4F1A;&#x6BD4; main() &#x51FD;&#x6570;&#x8FD8;&#x65E9;&#x88AB;&#x89E6;&#x53D1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x88AB;&#x52A0;&#x8F7D;&#x7684; bundle &#x91CC;&#x9762;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x5F53; bundle &#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x56E0;&#x4E3A; +load &#x65B9;&#x6CD5;&#x8FC7;&#x65E9;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x7528;&#x8D77;&#x6765;&#x4F1A;&#x6709;&#x70B9;&#x56F0;&#x96BE;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6709;&#x4E9B;&#x7C7B;&#x662F;&#x8981;&#x6BD4;&#x522B;&#x4EBA;&#x66F4;&#x65E9;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#x522B;&#x4EBA;&#x662F;&#x4E0D;&#x662F;&#x65E9;&#x5C31;&#x88AB;&#x8C03;&#x7528;&#x8FC7; +load &#x65B9;&#x6CD5;&#x4E86;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x5305;&#x542B;&#x7684; C++ &#x9759;&#x6001;&#x521D;&#x59CB;&#x5316;&#x51FD;&#x6570;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x673A;&#x70B9;&#x662F;&#x8FD8;&#x6CA1;&#x88AB;&#x8C03;&#x7528;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728; +load &#x91CC;&#x9762;&#x8C03;&#x7528;&#x4E86;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A; crash&#x3002;&#x597D;&#x6D88;&#x606F;&#x662F;&#x4F60;&#x94FE;&#x63A5;&#x7684; frameworks &#x662F;&#x4FDD;&#x8BC1;&#x5728; +load &#x8C03;&#x7528;&#x524D;&#x5C31;&#x52A0;&#x8F7D;&#x8FC7;&#x4E86;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528; framewroks &#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x7236;&#x7C7B;&#x4E5F;&#x662F;&#x4FDD;&#x8BC1;&#x5B8C;&#x5168;&#x52A0;&#x8F7D;&#x8FC7;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x7236;&#x7C7B;&#x4E5F;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#x3002;</p>
<p>+load &#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5C31;&#x662F; runtime &#x4F1A;&#x628A;&#x6240;&#x6709; category &#x91CC;&#x9762;&#x5B9E;&#x73B0;&#x4E86; +load &#x7684;&#x65B9;&#x6CD5;&#x5168;&#x90E8;&#x8C03;&#x4E00;&#x904D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5982;&#x679C;&#x4F60;&#x5728;&#x591A;&#x4E2A; category &#x91CC;&#x9762;&#x90FD;&#x5B9E;&#x73B0;&#x4E86; +load &#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x53EF;&#x80FD;&#x8DDF;&#x4F60;&#x8BA4;&#x8BC6;&#x5230; category &#x7684;&#x673A;&#x5236;&#x5B8C;&#x5168;&#x76F8;&#x53CD;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x8981;&#x77E5;&#x9053; +load &#x65B9;&#x6CD5;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x51B3;&#x5B9A;&#x4E86; +load &#x662F;&#x4E00;&#x4E2A;&#x5E72;&#x574F;&#x4E8B;&#x7684;&#x7EDD;&#x4F73;&#x573A;&#x6240;&#xFF0C;&#x6BD4;&#x5982; swizzling&#x3002;</p>
<h2 id="initialize"><a href="#initialize" class="headerlink" title="+initialize"></a>+initialize</h2><p>&#x76F8;&#x6BD4;&#x800C;&#x8A00;&#xFF0C;+initialize &#x65B9;&#x6CD5;&#x5C31;&#x8981;&#x6B63;&#x5E38;&#x7684;&#x591A;&#x4E86;&#xFF0C;&#x901A;&#x5E38;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x5B89;&#x7F6E;&#x4EE3;&#x7801;&#x7684;&#x5730;&#x65B9;&#x3002;+initialize &#x6709;&#x610F;&#x601D;&#x7684;&#x5730;&#x65B9;&#x5728;&#x4E8E;&#x5B83;&#x4F1A;&#x5F88;&#x665A;&#x624D;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x751A;&#x81F3;&#x5B83;&#x6709;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7C7B;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#xFF0C;+initialize &#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;ObjC &#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x90FD;&#x662F;&#x901A;&#x8FC7; runtime &#x7684;&#x6D88;&#x606F;&#x673A;&#x5236;&#xFF0C;objc_sendMsg &#x65B9;&#x6CD5;&#xFF09;&#xFF0C;runtime &#x5C31;&#x4F1A;&#x68C0;&#x67E5;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x6709;&#x6CA1;&#x6709;&#x88AB;&#x8C03;&#x7528;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5C31;&#x8C03;&#x7528;&#x4E4B;&#x3002;&#x5927;&#x6982;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p><div></div></p>
<p><div id="highlighter_919334" class="syntaxhighlighter  swift"></div></p>
<p><div class="toolbar"></div></p>
<p><pre class="lang:objc decode:true">id objc_msgSend(id self, SEL _cmd, &#x2026;)<br>{<br>    if(!self-&gt;class-&gt;initialized)<br>        [self-&gt;class initialize];<br>    &#x2026;send the message&#x2026;<br>}</pre><br><br><br><br>&#x5F53;&#x7136;&#x771F;&#x6B63;&#x7684;&#x5B9E;&#x73B0;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x8FD8;&#x8981;&#x89E3;&#x51B3;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x4E4B;&#x7C7B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8FC7;&#x5927;&#x6982;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x4E2A;&#x610F;&#x601D;&#x5427;&#x3002;&#x6BCF;&#x4E2A;&#x7C7B;&#x77E5;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x6B21; +initialize &#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x7C7B;&#x6536;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x8DDF; +load &#x65B9;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;+initialize &#x4F1A;&#x5148;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x7C7B;&#x6240;&#x6709;&#x7684;&#x7236;&#x7C7B;&#xFF0C;&#x6700;&#x540E;&#x624D;&#x8C03;&#x5230;&#x81EA;&#x5DF1;&#x7684; +initialize &#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x4F7F;&#x5F97; +initialize &#x7528;&#x8D77;&#x6765;&#x8981;&#x6BD4; +load &#x65B9;&#x6CD5;&#x66F4;&#x5B89;&#x5168;&#xFF0C;&#x56E0;&#x4E3A;&#x8C03;&#x7528;&#x65F6;&#x673A;&#x7684;&#x73AF;&#x5883;&#x8981;&#x5B89;&#x5168;&#x5F97;&#x591A;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x65F6;&#x5019;&#x7684;&#x73AF;&#x5883;&#x8FD8;&#x8981;&#x53D6;&#x51B3;&#x4E8E;&#x7B2C;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x673A;&#x4E00;&#x5B9A;&#x6BD4; NSApplicationMain() &#x8981;&#x665A;&#x3002;</p>
<p>&#x7531;&#x4E8E; +initialize &#x662F; lazily run &#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x662F;&#x505A;&#x6CE8;&#x518C;&#x4E8B;&#x4EF6;&#x7684;&#x597D;&#x5730;&#x65B9;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;NSValueTransformer &#x548C; NSURLProtocol &#x5C31;&#x4E0D;&#x80FD;&#x7528; +initialize &#x6765;&#x6CE8;&#x518C;&#x81EA;&#x5DF1;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5C31;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5148;&#x6709;&#x9E21;&#x8FD8;&#x662F;&#x5148;&#x6709;&#x86CB;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x9002;&#x5408;&#x7528;&#x6765;&#x505A;&#x9700;&#x8981;&#x5728;&#x7C7B;&#x88AB;&#x52A0;&#x8F7D;&#x540E;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x73AF;&#x5883;&#x5BB9;&#x9519;&#x6027;&#x66F4;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x5C31;&#x6BD4; +load &#x81EA;&#x7531;&#x5F97;&#x591A;&#xFF0C;&#x4E5F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x662F; lazy &#x8C03;&#x7528;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x5C31;&#x4E0D;&#x4F1A;&#x4E8B;&#x5148;&#x7533;&#x8BF7;&#x800C;&#x9020;&#x6210;&#x6D6A;&#x8D39;&#x3002;</p>
<p>+initialize &#x7684;&#x4F7F;&#x7528;&#x8FD8;&#x6709;&#x4E2A;&#x5C0F;&#x4F0E;&#x4FE9;&#xFF0C;&#x6211;&#x4E0A;&#x9762;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x91CC;&#x63D0;&#x5230; runtime &#x4F1A;&#x8C03;&#x7528;&#xFF1A;</p>
<p><pre class="lang:objc decode:true">[self-&gt;class initialize]</pre><br>&#x8FD9;&#x5C31;&#x5BFC;&#x81F4; ObjC &#x505A; selector &#x5B9E;&#x73B0;&#x7684;&#x68C0;&#x67E5;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x7C7B;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x4E0D;&#x53EA;&#x5728;&#x4F2A;&#x4EE3;&#x7801;&#x91CC;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x7684; +initialize &#x5C31;&#x5F97;&#x5199;&#x6210;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><pre class="lang:objc decode:true ">+ (void)initialize<br>{<br>    if(self == [WhateverClass class])<br>    {<br>        &#x2026;perform initialization&#x2026;<br>    }<br>}</pre><br>&#xA0;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x505A;&#x8FD9;&#x4E2A;&#x68C0;&#x67E5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x6CA1;&#x5B9E;&#x73B0; +initialize &#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x4E24;&#x6B21;&#x3002;&#x5C31;&#x7B97;&#x4F60;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5B50;&#x7C7B;&#xFF0C;Apple &#x7684; KVO &#x4E5F;&#x4F1A;<a href="https://www.mikeash.com/pyblog/friday-qa-2009-01-23.html" target="_blank" rel="external">&#x52A8;&#x6001;&#x521B;&#x5EFA;</a>&#x6CA1;&#x6709;&#x5B9E;&#x73B0; +initialize &#x7684;&#x5B50;&#x7C7B;&#x3002;</p>
<h2 id="&#x7ED3;&#x8BBA;"><a href="#&#x7ED3;&#x8BBA;" class="headerlink" title="&#x7ED3;&#x8BBA;"></a>&#x7ED3;&#x8BBA;</h2><p>ObjC &#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x79CD;&#x81EA;&#x52A8;&#x8FD0;&#x884C;&#x7C7B;&#x521D;&#x59CB;&#x5316;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#x3002;+load &#x65B9;&#x6CD5;&#x4FDD;&#x8BC1;&#x4E86;&#x4F1A;&#x5728; class &#x88AB;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;&#x8C03;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x673A;&#x5F88;&#x65E9;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x5F88;&#x65E9;&#x88AB;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x8BF4;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x673A;&#x8DD1;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5F88;&#x5371;&#x9669;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7684;&#x73AF;&#x5883;&#x6BD4;&#x8F83;&#x6076;&#x52A3;&#x3002;</p>
<p>&#x7531;&#x4E8E; +initialize &#x65B9;&#x6CD5;&#x662F; lazy &#x89E6;&#x53D1;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#x8BBE;&#x7F6E;&#x7684;&#x73AF;&#x5883;&#x5C31;&#x8981;&#x53CB;&#x597D;&#x5F97;&#x591A;&#x3002;&#x53EA;&#x8981;&#x4E0D;&#x662F;&#x5728;&#x7C7B;&#x63A5;&#x6536;&#x7B2C;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x4E4B;&#x524D;&#x4E00;&#x5B9A;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#x505A;&#x3002;</p>
<blockquote>
<p><strong>+load-&#x5F53;&#x7C7B;&#x52A0;&#x8F7D;&#x5230;OC&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E2D;(&#x5185;&#x5B58;),&#x5C31;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x6B21;.&#x6C38;&#x8FDC;&#x53EA;&#x8C03;&#x4E00;&#x6B21;!</strong></p>
<p><strong>+initialize-&#x5F53;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x6B21;.&#x53EF;&#x80FD;&#x4F1A;&#x8C03;2&#x6B21;!(&#x5B50;&#x7C7B;&#x6CA1;&#x6709;<strong>initialize&#x65B9;&#x6CD5;,&#x5E76;&#x4E14;&#x7236;&#x7C7B;&#x6709;,&#x4F1A;&#x8C03;2&#x6B21;&#x7236;&#x7C7B;</strong>)</strong></p>
<p>&#xA0;<br>&#x539F;&#x6587;&#x5730;&#x5740;:<a href="https://www.mikeash.com/pyblog/friday-qa-2009-05-22-objective-c-class-loading-and-initialization.html" target="_blank" rel="external">https://www.mikeash.com/pyblog/friday-qa-2009-05-22-objective-c-class-loading-and-initialization.html</a></p>
</blockquote>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/initialize/" rel="tag">#initialize</a>
          
            <a href="/tags/load/" rel="tag">#load</a>
          
            <a href="/tags/初始化/" rel="tag">#初始化</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/08/05/objective-cs-alloc-and-allocwithzone/" rel="next" title="Objective-C 里的 alloc 和 allocWithZone:">
                <i class="fa fa-chevron-left"></i> Objective-C 里的 alloc 和 allocWithZone:
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/08/07/mac-used-in-the-ios-command-line/" rel="prev" title="在IOS中mac常用命令行">
                在IOS中mac常用命令行 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="BirdMichael" />
          <p class="site-author-name" itemprop="name">BirdMichael</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">57</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">85</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#load"><span class="nav-number">1.</span> <span class="nav-text">+load</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#initialize"><span class="nav-number">2.</span> <span class="nav-text">+initialize</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#结论"><span class="nav-number">3.</span> <span class="nav-text">结论</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">BirdMichael</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  

  

  

  

</body>
</html>
