<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x5B66;&amp;#x4F1A;&amp;#x4E00;&amp;#x95E8;&amp;#x7F16;&amp;#x7A0B;&amp;#x8BED;&amp;#x8A00;&amp;#x5BB9;&amp;#x6613;&amp;#xFF0C;&amp;#x7CBE;&amp;#x901A;&amp;#x5F88;&amp;#x96BE;&amp;#xFF0C;&amp;#x96BE;&amp;#x5C31;&amp;#x96BE;&amp;#x5728;&amp;#x7406;&amp;#x89E3;&amp;#x5B83;&amp;#x7684;&amp;#x7CBE;">
<meta property="og:type" content="article">
<meta property="og:title" content="Talk is cheap. Show me the code.">
<meta property="og:url" content="http://yoursite.com/2015/06/28/talk-is-cheap-show-me-the-code/index.html">
<meta property="og:site_name" content="BirdMichael">
<meta property="og:description" content="&amp;#x5B66;&amp;#x4F1A;&amp;#x4E00;&amp;#x95E8;&amp;#x7F16;&amp;#x7A0B;&amp;#x8BED;&amp;#x8A00;&amp;#x5BB9;&amp;#x6613;&amp;#xFF0C;&amp;#x7CBE;&amp;#x901A;&amp;#x5F88;&amp;#x96BE;&amp;#xFF0C;&amp;#x96BE;&amp;#x5C31;&amp;#x96BE;&amp;#x5728;&amp;#x7406;&amp;#x89E3;&amp;#x5B83;&amp;#x7684;&amp;#x7CBE;">
<meta property="og:updated_time" content="2016-07-25T06:30:02.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Talk is cheap. Show me the code.">
<meta name="twitter:description" content="&amp;#x5B66;&amp;#x4F1A;&amp;#x4E00;&amp;#x95E8;&amp;#x7F16;&amp;#x7A0B;&amp;#x8BED;&amp;#x8A00;&amp;#x5BB9;&amp;#x6613;&amp;#xFF0C;&amp;#x7CBE;&amp;#x901A;&amp;#x5F88;&amp;#x96BE;&amp;#xFF0C;&amp;#x96BE;&amp;#x5C31;&amp;#x96BE;&amp;#x5728;&amp;#x7406;&amp;#x89E3;&amp;#x5B83;&amp;#x7684;&amp;#x7CBE;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://yoursite.com/2015/06/28/talk-is-cheap-show-me-the-code/"/>

  <title> Talk is cheap. Show me the code. | BirdMichael </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">BirdMichael</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                Talk is cheap. Show me the code.
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-06-28T21:14:16+08:00" content="2015-06-28">
              2015-06-28
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/杂。/" itemprop="url" rel="index">
                    <span itemprop="name">杂。</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5B66;&#x4F1A;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5BB9;&#x6613;&#xFF0C;&#x7CBE;&#x901A;&#x5F88;&#x96BE;&#xFF0C;&#x96BE;&#x5C31;&#x96BE;&#x5728;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x7CBE;&#x9AD3;&#x3002;&#x6709;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x70ED;&#x8877;&#x4E8E;&#x6700;&#x65B0;&#x6F6E;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4ECA;&#x5929;&#x73A9;&#x73A9;NoSQL&#xFF0C;&#x660E;&#x5929;&#x641E;&#x641E;Html 5&#xFF0C;&#x8BF4;&#x8D77;&#x6765;&#x5934;&#x5934;&#x662F;&#x9053;&#xFF0C;&#x4F46;&#x662F;&#x90FD;&#x6DF1;&#x5165;&#x4E0D;&#x4E0B;&#x53BB;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x6CA1;&#x6709;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x7CBE;&#x9AD3;&#xFF0C;&#x4E5F;&#x5C31;&#x505A;&#x4E0D;&#x51FA;&#x4E00;&#x4E2A;&#x80FD;&#x53D1;&#x6325;&#x51FA;&#x5B83;&#x4EEC;&#x771F;&#x6B63;&#x4F18;&#x52BF;&#x7684;&#x4EA7;&#x54C1;&#x6765;&#x3002;&#x8FD9;&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x5185;&#x529F;&#x4E0D;&#x884C;&#x800C;&#x5FC3;&#x6001;&#x53C8;&#x5F88;&#x6D6E;&#x8E81;,&#x4F46;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x9760;&#x4EE3;&#x7801;&#x8BF4;&#x8BDD;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5584;&#x4E8E;&#x5BF9;&#x67D0;&#x4E2A;&#x6280;&#x672F;&#x4F83;&#x4F83;&#x800C;&#x8C08;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EF7;&#x503C;&#x3002;Linux&#x548C;Git&#x4E4B;&#x7236;Linus Torvalds&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;<strong>Talk is cheap. Show me the code.</strong>&#x201D;&#xFF08;&#x7A7A;&#x8C08;&#x65E0;&#x4EF7;&#x503C;&#x3002;&#x62FF;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x770B;&#x770B;&#x3002;&#xFF09;&#x6240;&#x4EE5;&#x8001;&#x592B;&#x8981;&#x8BF4;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4E0D;&#x5148;&#x7EC3;&#x597D;&#x5185;&#x529F;&#x5C31;&#x5199;&#x4E0D;&#x51FA;&#x4F18;&#x96C5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x8D70;&#x4E0D;&#x8FDC;&#x7684;&#x3002;</p>
<p>&#xA0;</p>
<p><strong>&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x4E0E;&#x5DE5;&#x5177;&#x6765;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;</strong></p>
<p>&#x5F53;&#x4F60;&#x53C2;&#x4E0E;&#x4E86;&#x5F88;&#x591A;&#x9879;&#x76EE;&#xFF0C;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7ECF;&#x5E38;&#x505A;&#x4E00;&#x4E9B;COPY,PASTE&#x7684;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x63D0;&#x53D6;&#x95EE;&#x9898;&#x7684;&#x5171;&#x6027;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x53BB;&#x6446;&#x5E73;&#x95EE;&#x9898;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5199;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x6846;&#x67B6;&#x6765;&#x5C4F;&#x853D;&#x8FD9;&#x4E9B;&#x65E0;&#x804A;&#x5E76;&#x4E14;&#x7D2F;&#x8D58;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x4E0E;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5FEB;&#x901F;&#x7684;&#x4ECE;&#x4E00;&#x4E2A;&#x521D;&#x7EA7;&#x7A0B;&#x5E8F;&#x5458;&#x8F6C;&#x53D8;&#x6210;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6216;&#x5206;&#x6790;&#x5E08;&#x6216;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;&#x4E3A;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x5458;&#x670D;&#x52A1;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4F60;&#x6709;&#x52A8;&#x529B;&#x53BB;&#x4E86;&#x89E3;&#x5176;&#x5B83;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x9700;&#x6C42;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x7684;&#x6846;&#x67B6;&#x6216;&#x5DE5;&#x5177;&#x5199;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x63A5;&#x53E3;&#x7B80;&#x5355;&#x7075;&#x6D3B;&#x5E76;&#x4E14;&#x6027;&#x80FD;&#x597D;&#xFF0C;&#x5206;&#x6790;&#x5E08;&#x548C;&#x67B6;&#x6784;&#x5E08;&#x5C31;&#x7ECF;&#x5E38;&#x8981;&#x5E72;&#x8FD9;&#x79CD;&#x8BA9;&#x4EBA;&#x529B;&#x6210;&#x672C;&#x964D;&#x4F4E;&#x7684;&#x4E8B;&#x3002;&#x4F46;&#x8981;&#x8BB0;&#x4F4F;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x4E0E;&#x5DE5;&#x5177;&#x5C31;&#x8BA4;&#x4E3A;&#x5F88;NB&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x4F1A;&#x4F53;&#x73B0;&#x591A;&#x5C11;&#x6280;&#x672F;&#x542B;&#x91CF;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x63D0;&#x9AD8;&#x4E2A;&#x4EBA;&#x62BD;&#x8C61;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D3B;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x80FD;&#x5E72;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5C11;&#x4EBA;&#x53BB;&#x5E72;&#x597D;&#x3002;</p>
<p><strong>&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;</strong></p>
<p>&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x9886;&#x7565;&#x5230;&#x4E0D;&#x540C;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6C9F;&#x901A;&#x65B9;&#x6CD5;&#xFF0C;&#x5F00;&#x53D1;&#x4E60;&#x60EF;&#xFF0C;&#x6280;&#x672F;&#x601D;&#x7EF4;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x8BC6;&#x66F4;&#x591A;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8DB3;&#x591F;&#x5F3A;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E00;&#x4E3E;&#x6210;&#x540D;&#x54E6;&#x3002;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x66F4;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x5F00;&#x6E90;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x662F;&#x611F;&#x5174;&#x8DA3;&#x6216;&#x8005;&#x662F;&#x4E0E;&#x5DE5;&#x4F5C;&#x6709;&#x5173;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x8BF4;&#x4EC0;&#x4E48;&#x6D41;&#x884C;&#x5C31;&#x53C2;&#x4E0E;&#x4EC0;&#x4E48;&#x3002;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x8D21;&#x732E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6216;&#x8005;&#x53C2;&#x4E0E;&#x4E00;&#x4E2A;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x6307;&#x671B;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4F1A;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x76F4;&#x63A5;&#x7684;&#x91D1;&#x94B1;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x62FF;&#x7740;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5C01;&#x88C5;&#x4E00;&#x4E0B;&#x53BB;&#x53D1;&#x8D22;&#xFF0C;&#x90A3;&#x6211;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x505A;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x95EE;&#x95EE;&#x4EC0;&#x4E48;&#x4EC0;&#x4E48;&#x82AF;&#xFF0C;&#x4EC0;&#x4E48;&#x4EC0;&#x4E48;&#x56FD;&#x4EA7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x66F4;&#x6709;&#x7ECF;&#x9A8C;&#x3002;&#xFF08;&#x6CE8;&#xFF1A;&#x300A;<a href="http://blog.jobbole.com/278" target="_blank" rel="external">&#x7A0B;&#x5E8F;&#x5458;&#xFF1A;&#x589E;&#x52A0;&#x7F16;&#x7A0B;&#x7ECF;&#x9A8C;&#x7684;3&#x79CD;&#x9014;&#x5F84;</a>&#x300B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4EA6;&#x5EFA;&#x8BAE;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;&#xFF09;</p>
<p><strong>&#x82F1;&#x8BED;</strong></p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x5168;&#x7403;&#x4FE1;&#x606F;&#x65F6;&#x4EE3;&#xFF0C;&#x82F1;&#x8BED;&#x771F;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x5F88;&#x7FA1;&#x6155;&#x90A3;&#x4E9B;&#x5B66;&#x6821;&#x91CC;&#x82F1;&#x8BED;&#x5C31;&#x5F88;&#x597D;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x597D;&#x7684;&#x82F1;&#x8BED;&#x80FD;&#x529B;&#x53EF;&#x4EE5;&#x66F4;&#x5FEB;&#x901F;&#x7684;&#x4E86;&#x89E3;&#x5230;&#x66F4;&#x591A;&#x77E5;&#x8BC6;&#x3002;&#x5F53;&#x524D;&#xFF0C;&#x65B0;&#x7684;&#x6280;&#x672F;&#x4E0E;&#x77E5;&#x8BC6;&#x5927;&#x90E8;&#x4EFD;&#x8BED;&#x8A00;&#x90FD;&#x662F;&#x82F1;&#x8BED;&#x6216;&#x7FFB;&#x8BD1;&#x6210;&#x82F1;&#x8BED;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x628A;&#x82F1;&#x8BED;&#x5B66;&#x597D;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x4EBA;&#x751F;&#x5C11;&#x594B;&#x6597;10&#x5E74;&#x3002;</p>
<p><strong>&#x5199;&#x6280;&#x672F;&#x535A;&#x5BA2;</strong></p>
<p>&#x5199;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x63D0;&#x9AD8;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x80FD;&#x575A;&#x6301;&#x6BCF;&#x5468;&#x5199;&#x6280;&#x672F;&#x535A;&#x5BA2;&#xFF0C;&#x90A3;&#x662F;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x5F88;&#x591A;&#x4EE3;&#x4EF7;&#xFF0C;&#x5199;&#x535A;&#x5BA2;&#x5E76;&#x4E0D;&#x662F;&#x8981;&#x6211;&#x4EEC;&#x5199;&#x51FA;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6587;&#x7AE0;&#x624D;&#x53D1;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x5C0F;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5206;&#x4EAB;&#x81EA;&#x5DF1;&#x7684;&#x4F53;&#x4F1A;&#x3002;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#x5728;&#x4F60;&#x5927;&#x8111;&#x91CC;&#xFF0C;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x4F60;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x8BF4;&#x7ED9;&#x522B;&#x4EBA;&#x542C;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x6587;&#x5B57;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x9996;&#x5148;&#x4F60;&#x8981;&#x5C06;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x6574;&#x7406;&#x6E05;&#x695A;&#x624D;&#x597D;&#x8868;&#x8FBE;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x5BF9;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#x89E3;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6574;&#x7406;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x65F6;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8BC6;&#x76F2;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x67E5;&#x627E;&#x77E5;&#x8BC6;&#x6765;&#x8865;&#x5145;&#x81EA;&#x5DF1;&#x7684;&#x76F2;&#x70B9;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E;&#x641E;&#x6E05;&#x695A;&#x4E86;&#x624D;&#x7B97;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x4EBA;&#x4E0D;&#x559C;&#x6B22;&#x5206;&#x4EAB;&#x6216;&#x8005;&#x5BB3;&#x6015;&#x5206;&#x4EAB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x662F;&#x516C;&#x53F8;&#x673A;&#x5BC6;&#x6216;&#x5546;&#x4E1A;&#x79D8;&#x5BC6;&#xFF0C;&#x62FF;&#x51FA;&#x6765;&#x5206;&#x4EAB;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x540C;&#x884C;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4EBA;&#x4F1A;&#x7ED9;&#x4F60;&#x76F8;&#x5BF9;&#x771F;&#x5B9E;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x4EFD;&#x4EBA;&#x4E0E;&#x4F60;&#x6CA1;&#x6709;&#x5229;&#x76CA;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x65B0;&#x4EBA;&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#x81EA;&#x5DF1;&#x5206;&#x4EAB;&#x7684;&#x77E5;&#x8BC6;&#x662F;&#x5426;&#x6709;&#x6280;&#x672F;&#x542B;&#x91CF;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x8BA4;&#x4E3A;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x62FF;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x7ED9;&#x522B;&#x4EBA;&#x63D0;&#x4F9B;&#x77E5;&#x8BC6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x6574;&#x7406;&#x601D;&#x8DEF;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7F51;&#x53CB;&#x7684;&#x53CD;&#x9988;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x5206;&#x4EAB;&#x51FA;&#x6765;&#x4E5F;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6587;&#x7AE0;&#x6280;&#x672F;&#x542B;&#x91CF;&#x4F4E;&#xFF0C;&#x6015;&#x88AB;&#x4EBA;&#x9119;&#x89C6;&#xFF0C;&#x90A3;&#x662F;&#x4F60;&#x8FD9;&#x4E2A;&#x4EBA;&#x4E0D;&#x6562;&#x627F;&#x8BA4;&#x73B0;&#x5B9E;&#xFF0C;&#x56E0;&#x4E3A;&#x540C;&#x4E8B;&#x4E0E;&#x670B;&#x53CB;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x8BF4;&#x4F60;&#x7684;&#x6587;&#x7AE0;&#x5F88;&#x83DC;&#xFF0C;&#x5C31;&#x7B97;&#x88AB;&#x9119;&#x89C6;&#x4E86;&#x53C8;&#x5982;&#x4F55;&#xFF0C;&#x6709;&#x65F6;&#x88AB;&#x4EBA;&#x9119;&#x89C6;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x524D;&#x8FDB;&#x7684;&#x52A8;&#x529B;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#x5982;&#x679C;&#x51E0;&#x5E74;&#x540E;&#x6211;&#x8FDB;&#x6B65;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x8FD8;&#x8BA9;&#x4EBA;&#x770B;&#x5230;&#x6211;&#x8FD9;&#x4E9B;&#x521D;&#x5B66;&#x65F6;&#x5F31;&#x667A;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x8BEF;&#x4EBA;&#x5B50;&#x5F1F;&#xFF0C;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;Ok&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x6709;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x628A;&#x6587;&#x6863;&#x5220;&#x9664;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x653E;&#x5728;&#x90A3;&#x91CC;&#x54C1;&#x5473;&#x81EA;&#x5DF1;&#x6210;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x628A;&#x6709;&#x8BEF;&#x5BFC;&#x7684;&#x5730;&#x65B9;&#x66F4;&#x6B63;&#x3002;</p>
<p>&#x6211;&#x77E5;&#x9053;&#x6709;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x535A;&#x5BA2;&#x4F5C;&#x8005;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E13;&#x5BB6;&#x6768;&#x5EF7;&#x7428;&#xFF0C;&#x4ED6;&#x51E0;&#x5E74;&#x6765;&#xFF0C;&#x6BCF;&#x5929;&#x575A;&#x6301;&#x5199;&#x4E00;&#x7BC7;&#x6280;&#x672F;&#x535A;&#x5BA2;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6709;2&#x5343;&#x591A;&#x7BC7;&#xFF0C;&#x6211;&#x7684;ORACLE&#x6570;&#x636E;&#x5E93;&#x6C34;&#x5E73;&#x6BD4;&#x4ED6;&#x5DEE;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4E5F;&#x5076;&#x5C14;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x4ED6;&#x65B0;&#x5199;&#x7684;&#x6587;&#x6863;&#x6211;&#x51E0;&#x5E74;&#x524D;&#x5C31;&#x4F1A;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x59A8;&#x788D;&#x6211;&#x5BF9;&#x8FD9;&#x4F4D;&#x535A;&#x5BA2;&#x4F5C;&#x8005;&#x7684;&#x656C;&#x4F69;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x7684;&#x535A;&#x5BA2;&#x8BA9;&#x6211;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x77E5;&#x8BC6;&#x3002;&#xFF08;&#x4F2F;&#x4E50;&#x5728;&#x7EBF;&#x6CE8;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x5728;/&#x8BA1;&#x5212;&#x5199;&#x6280;&#x672F;&#x535A;&#x5BA2;&#xFF0C;&#x5E0C;&#x671B;&#x66F4;&#x591A;&#x4EBA;&#x770B;&#x5230;&#x4F60;&#x662F;&#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x53EF;&#x4EE5;<a href="http://top.jobbole.com/" target="_blank" rel="external">&#x6295;&#x9012;&#x5230;&#x4F2F;&#x4E50;&#x5934;&#x6761;</a>&#x3002;&#x4F2F;&#x4E50;&#x5934;&#x6761;&#x4EE5;&#x6458;&#x8981;+&#x8DF3;&#x8F6C;&#x5230;&#x539F;&#x59CB;&#x51FA;&#x5904;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E3A;&#x5E2E;&#x52A9;&#x539F;&#x521B;&#x4F5C;&#x8005;&#x5E26;&#x53BB;&#x66F4;&#x591A;&#x8BFB;&#x8005;&#xFF09;</p>
<p><strong>&#x52A0;&#x5165;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x6280;&#x672F;&#x8BBA;&#x575B;</strong></p>
<p>&#x6BCF;&#x4E2A;&#x516C;&#x53F8;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#x4E0E;&#x4EA7;&#x54C1;&#x53CA;&#x73AF;&#x5883;&#x90FD;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#xFF0C;&#x4E5F;&#x8BB8;&#x4F60;&#x5728;&#x516C;&#x53F8;&#x91CC;&#x611F;&#x89C9;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x522B;&#x4EBA;&#x505A;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x4E2A;&#x6D41;&#x6C34;&#x7EBF;&#x5DE5;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x7531;&#x4E8E;&#x6709;&#x4E25;&#x683C;&#x7684;&#x89C4;&#x8303;&#x4E5F;&#x4E0D;&#x592A;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x8DF5;&#x63D0;&#x9AD8;&#x673A;&#x4F1A;&#x592A;&#x5C11;&#xFF0C;&#x90A3;&#x5EFA;&#x8BAE;&#x4F60;&#x52A0;&#x5165;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x6280;&#x672F;&#x8BBA;&#x575B;&#x3002;</p>
<p>&#x6280;&#x672F;&#x8BBA;&#x575B;&#x4E0A;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5F88;&#x591A;&#x4EBA;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x95EE;&#x9898;&#x4E0E;&#x5206;&#x4EAB;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8BD5;&#x7740;&#x53BB;&#x5E2E;&#x522B;&#x4EBA;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x6280;&#x672F;&#x8BBA;&#x575B;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x8FDB;&#x4E00;&#x6B65;&#x6210;&#x957F;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x544A;&#x8BC9;&#x6211;&#x4F60;&#x53EA;&#x662F;&#x4F1A;&#x6C99;&#x53D1;&#x3001;&#x9876;&#x6216;&#x63A5;&#x5206;&#x7684;&#x90A3;&#x79CD;&#x3002;</p>
<p>&#x56FD;&#x5185;CSDN&#x3001;ITPUB&#x3001;CHINAUNIX&#x3001;JAVAEYE&#x3001;MSDN&#x90FD;&#x662F;&#x4EBA;&#x6C14;&#x5F88;&#x65FA;&#xFF0C;&#x91CC;&#x9762;&#x4E5F;&#x4E0D;&#x7F3A;&#x6280;&#x672F;&#x5927;&#x725B;&#x4E0E;&#x65E0;&#x654C;&#x5927;&#x83DC;&#x9E1F;&#x3002;</p>
<p><strong>&#x5E38;&#x770B;&#x53C2;&#x8003;&#x624B;&#x518C;</strong></p>
<p>&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x9047;&#x5230;&#x95EE;&#x9898;&#x559C;&#x6B22;&#x76F4;&#x63A5;&#x53BB;&#x8BF7;&#x6559;&#x522B;&#x4EBA;&#xFF0C;&#x6216;&#x662F;Google&#x627E;&#x7ED3;&#x679C;&#xFF0C;&#x901A;&#x8FC7;&#x522B;&#x4EBA;&#x6216;Google&#x4E5F;&#x8BB8;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x80FD;&#x5F62;&#x6210;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x4E0D;&#x80FD;&#x5F62;&#x6210;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x3002;</p>
<p>&#x8981;&#x5168;&#x9762;&#x638C;&#x63E1;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x6700;&#x5FEB;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x770B;&#x4EA7;&#x54C1;&#x7684;&#x5B98;&#x65B9;&#x53C2;&#x8003;&#x624B;&#x518C;&#xFF0C;&#x53C2;&#x8003;&#x624B;&#x518C;&#x4E00;&#x822C;&#x662F;&#x4EE3;&#x8868;&#x6B63;&#x89C4;&#x7684;&#x7528;&#x6CD5;&#x6216;&#x8005;&#x662F;&#x63A8;&#x8350;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E8E;&#x5C0F;&#x4EA7;&#x54C1;&#x6700;&#x597D;&#x662F;&#x5148;&#x5C06;&#x53C2;&#x8003;&#x624B;&#x518C;&#x5168;&#x90E8;&#x770B;&#x4E00;&#x904D;&#x3002;&#x5982;&#x679C;&#x662F;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x4EA7;&#x54C1;&#x5982;&#xFF08;ORACLE&#x3001;JAVA&#x3001;.NET&#xFF09;&#x90A3;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x770B;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x90E8;&#x5206;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x4F60;&#x5728;&#x770B;&#x5B8C;&#x53C2;&#x8003;&#x624B;&#x518C;&#x8FD8;&#x4E0D;&#x61C2;&#x7684;&#x65F6;&#x5019;&#x518D;&#x53BB;Google&#x6216;&#x4E0E;&#x522B;&#x4EBA;&#x63A2;&#x8BA8;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x66F4;&#x4F53;&#x7CFB;&#x5316;&#x3002;</p>
<p><strong>&#x6DF1;&#x5165;&#x5206;&#x6790;&#x95EE;&#x9898;&#x539F;&#x56E0;</strong></p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x5B9A;&#x8981;&#x5177;&#x5907;&#x5BF9;&#x6280;&#x672F;&#x95EE;&#x9898;&#x5228;&#x6839;&#x95EE;&#x5E95;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x60F3;&#x53BB;&#x4E86;&#x89E3;&#x95EE;&#x9898;&#x7684;&#x6839;&#x6E90;&#x3002;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x91CD;&#x542F;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x91CD;&#x542F;&#x673A;&#x5668;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x7A0B;&#x5E8F;&#x5458;&#x4F1A;&#x53BB;&#x6316;&#x6398;&#x91CD;&#x542F;&#x5C31;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x539F;&#x56E0;&#x3002;&#x6211;&#x662F;&#x4ECE;&#x4E8B;&#x6570;&#x636E;&#x5E93;&#x7684;&#xFF0C;&#x4E5F;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x5F88;&#x591A;&#x4EBA;&#x9047;&#x5230;&#x6570;&#x636E;&#x5E93;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x91CD;&#x88C5;&#x4E00;&#x4E0B;&#x641E;&#x5B9A;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x6DF1;&#x5165;&#x5206;&#x6790;&#x95EE;&#x9898;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x3002;&#x4E5F;&#x8BB8;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x53BB;&#x5206;&#x6790;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x3001;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x4E5F;&#x7ECF;&#x5E38;&#x91CD;&#x542F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x80FD;&#x5728;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x4E0E;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x662F;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x6210;&#x957F;&#x7684;&#x6700;&#x597D;&#x673A;&#x4F1A;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x9886;&#x57DF;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x653E;&#x8FC7;&#x8FD9;&#x79CD;&#x6210;&#x957F;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x4EFD;&#x4E13;&#x5BB6;&#x90FD;&#x662F;&#x5728;&#x8FD9;&#x79CD;&#x5386;&#x7EC3;&#x4E2D;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p><strong>&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#x590D;&#x6742;</strong></p>
<p>&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x4E60;&#x60EF;&#x4E86;&#x5229;&#x7528;&#x5404;&#x79CD;&#x6846;&#x67B6;&#x53CA;&#x5DE5;&#x5177;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x81EA;&#x5DF1;&#x53EA;&#x662F;&#x5199;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x903B;&#x8F91;&#xFF0C;&#x5F53;&#x6709;&#x4E00;&#x5929;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6CA1;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x6846;&#x67B6;&#x6216;&#x5DE5;&#x5177;&#x65F6;&#x5C31;&#x653E;&#x5F03;&#x9700;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#x56F0;&#x96BE;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6BCF;&#x5929;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x6CA1;&#x6709;&#x6311;&#x6218;&#xFF0C;&#x90A3;&#x4F55;&#x6765;&#x63D0;&#x9AD8;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x7ED9;&#x81EA;&#x5DF1;&#x4E00;&#x4E9B;&#x538B;&#x529B;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x81EA;&#x5DF1;&#x63D0;&#x9AD8;&#x5F97;&#x66F4;&#x5FEB;&#x4E00;&#x4E9B;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x5F15;&#x64CE;&#x3001;&#x7F16;&#x8BD1;&#x5668;&#x3001;&#x89E3;&#x6790;&#x5668;&#x3001;&#x754C;&#x9762;&#x8BBE;&#x8BA1;&#x5668;&#x3001;&#x5C4F;&#x5E55;&#x63A7;&#x5236;&#x5668;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;http&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x4E1C;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x611F;&#x89C9;&#x4E0D;&#x592A;&#x6EE1;&#x610F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x53BB;&#x641E;&#x4E00;&#x4E2A;&#x8BD5;&#x8BD5;&#xFF0C;&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#x4E0D;&#x6210;&#x529F;&#xFF0C;&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#x81EA;&#x5DF1;&#x505A;&#x4E0D;&#x597D;&#x3002;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x770B;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x6DF1;&#x5165;&#x53BB;&#x505A;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x91CC;&#x9762;&#x6709;&#x5F88;&#x591A;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x53BB;&#x9010;&#x6B65;&#x6539;&#x8FDB;&#x4F60;&#x7684;&#x5C0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x8FD0;&#x884C;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5BF9;&#x7A0B;&#x5E8F;&#x6709;&#x66F4;&#x6DF1;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4E5F;&#x53EF;&#x6253;&#x5F00;&#x601D;&#x8DEF;&#x3002;</p>
<p><strong>&#x5B66;&#x4E60;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#xFF0C;&#x6DF1;&#x5165;&#x6280;&#x672F;&#x539F;&#x7406;</strong></p>
<p>&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8FF7;&#x60D8;&#xFF0C;&#x611F;&#x89C9;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x6CA1;&#x6709;&#x63D0;&#x9AD8;&#xFF0C;&#x611F;&#x89C9;&#x6280;&#x672F;&#x80FD;&#x529B;&#x603B;&#x662F;&#x6D6E;&#x5728;&#x8868;&#x9762;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7B97;&#x6CD5;&#x5206;&#x6790;&#x3001;&#x6027;&#x80FD;&#x5206;&#x6790;&#x3001;&#x6545;&#x969C;&#x8BCA;&#x65AD;&#x80FD;&#x529B;&#x6709;&#x9650;&#x65F6;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x662F;&#x4F60;&#x518D;&#x6B21;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56E0;&#x4E3A;&#x57FA;&#x7840;&#x4E0D;&#x7262;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x95EE;&#x9898;&#x8BCA;&#x65AD;&#x51C6;&#x786E;&#x7387;&#x4E0D;&#x9AD8;&#x3002;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x8BE5;&#x90FD;&#x5B66;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#xFF08;&#x8BA1;&#x7B97;&#x673A;&#x4F53;&#x7CFB;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x6570;&#x636E;&#x5E93;&#x539F;&#x7406;&#x3001;&#x7B97;&#x6CD5;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x5BF9;&#x5F88;&#x591A;&#x4EBA;&#x6765;&#x8BF4;&#x662F;&#x5F88;&#x67AF;&#x71E5;&#x3002;&#x5728;&#x5F53;&#x524D;&#x9AD8;&#x7EA7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x65F6;&#x4EE3;&#xFF0C;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x4E0D;&#x597D;&#x4E5F;&#x80FD;&#x7F16;&#x7801;&#xFF0C;&#x800C;&#x4E14;&#x6548;&#x7387;&#x4E5F;&#x4E0D;&#x4F4E;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x8981;&#x60F3;&#x6210;&#x4E3A;&#x6280;&#x672F;&#x725B;&#x4EBA;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x5C31;&#x662F;&#x4E00;&#x9053;&#x574E;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x624E;&#x5B9E;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x4F1A;&#x8BA9;&#x4F60;&#x5728;&#x5FFD;&#x60A0;&#x4E0E;&#x88AB;&#x5FFD;&#x60A0;&#x4E2D;&#x6210;&#x957F;&#x3002;</p>
<p><strong>&#x5173;&#x5FC3;&#x4EA7;&#x54C1;&#x5E02;&#x573A;&#x4E0E;&#x5546;&#x4E1A;&#x52A8;&#x6001;</strong></p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x5426;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x4EA7;&#x54C1;&#x5E02;&#x573A;&#x4E0E;&#x5546;&#x4E1A;&#x52A8;&#x6001;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x662F;&#x6709;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x771F;&#x662F;&#x6280;&#x672F;&#x5929;&#x624D;&#xFF0C;&#x80FD;&#x95ED;&#x5173;&#x5341;&#x5E74;&#x540E;&#x6A2A;&#x626B;&#x6C5F;&#x6E56;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x592A;&#x5FEB;&#xFF0C;&#x6BCF;&#x5E74;&#x90FD;&#x6709;&#x65B0;&#x7684;&#x6D41;&#x884C;&#x4EA7;&#x54C1;&#x4E0E;&#x6280;&#x672F;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x4E5F;&#x7ECF;&#x5E38;&#x6539;&#x53D8;&#x6218;&#x7565;&#x6216;&#x6613;&#x4E3B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5F15;&#x9886;&#x6280;&#x672F;&#x6F6E;&#x6D41;&#xFF0C;&#x60F3;&#x521B;&#x4E1A;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x8981;&#x5173;&#x5FC3;&#x4EA7;&#x54C1;&#x5E02;&#x573A;&#x4E0E;&#x5546;&#x4E1A;&#x52A8;&#x6001;&#x3002;</p>
<p><strong>&#x4E0D;&#x8981;&#x53BB;&#x8F7B;&#x89C6;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x804C;&#x4F4D;&#x3001;&#x8BED;&#x8A00;&#x3001;&#x5DE5;&#x5177;</strong></p>
<p>&#x5728;IT&#x5C97;&#x4F4D;&#x91CC;&#xFF0C;&#x6CA1;&#x6709;&#x9AD8;&#x4F4E;&#x4E4B;&#x5206;&#xFF0C;&#x4E0D;&#x8981;&#x53BB;&#x8F7B;&#x89C6;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x5C97;&#x4F4D;&#xFF0C;&#x6709;&#x4E9B;&#x7A0B;&#x5E8F;&#x5458;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x679C;&#x6700;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x7F8E;&#x5DE5;&#x3001;&#x6D4B;&#x8BD5;&#x53EA;&#x662F;&#x8FB9;&#x7F18;&#x5C97;&#x4F4D;&#xFF0C;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x5C31;&#x53EA;&#x4F1A;&#x778E;&#x6307;&#x6325;&#xFF0C;&#x4E0D;&#x5E72;&#x6D3B;&#xFF0C;&#x9500;&#x552E;&#x4EBA;&#x5458;&#x4E0E;&#x552E;&#x524D;&#x4EBA;&#x5458;&#x63A5;&#x5230;&#x5B9A;&#x5355;&#x540E;&#x5C41;&#x4E8B;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6210;&#x679C;&#x3002;&#x8FD9;&#x79CD;&#x5FC3;&#x6001;&#x662F;&#x6700;&#x8981;&#x4E0D;&#x5F97;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x4F60;&#x7684;&#x9886;&#x5BFC;&#x5E76;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x60F3;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x662F;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x5982;&#x5BA2;&#x6237;&#x5173;&#x7CFB;&#x5C31;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x4F60;&#x4E00;&#x4E2A;&#x4EBA;&#x641E;&#x5B9A;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x6CA1;&#x6709;&#x4F60;&#x53C2;&#x52A0;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x9879;&#x76EE;&#x53EF;&#x80FD;&#x6362;&#x6210;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#xFF0C;&#x4E5F;&#x8BB8;&#x4ED6;&#x4E5F;&#x80FD;&#x505A;&#x5F97;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x8FD9;&#x5C31;&#x8BF4;&#x660E;&#x4F60;&#x7684;&#x4EF7;&#x503C;&#x6216;&#x91CD;&#x8981;&#x6027;&#x5E76;&#x4E0D;&#x50CF;&#x4F60;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>&#x5C31;&#x597D;&#x6BD4;&#x4F60;&#x4E70;&#x4E00;&#x53F0;&#x8054;&#x60F3;&#x7535;&#x8111;4000&#x5757;&#xFF0C;&#x5356;&#x7ED9;&#x4E00;&#x4E2A;&#x6CA1;&#x770B;&#x8FC7;&#x7535;&#x8111;&#x7684;&#x706B;&#x661F;&#x4EBA;20000&#x5757;&#xFF0C;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x662F;&#x6700;&#x540E;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x5426;&#x8868;&#x793A;&#x8054;&#x60F3;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x4F60;&#x4E70;&#x4E00;&#x53F0;&#x6234;&#x5C14;&#x7684;&#x7535;&#x8111;&#x8FD8;&#x8D5A;&#x7684;&#x94B1;&#x66F4;&#x591A;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F60;&#x53EA;&#x8981;&#x7ED9;&#x5BF9;&#x65B9;&#x4E00;&#x53F0;&#x6742;&#x724C;&#x7535;&#x8111;&#x5C31;&#x53EF;&#x4EE5;&#x62FF;&#x5230;20000&#x5757;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E5F;&#x8BB8;&#x662F;&#x5BA2;&#x6237;&#x5173;&#x7CFB;&#x4E0E;&#x6293;&#x4F4F;&#x5546;&#x673A;&#xFF0C;&#x800C;&#x4E70;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7535;&#x8111;&#x5F71;&#x54CD;&#x4E0D;&#x5927;&#xFF08;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x91CC;&#x7684;&#x5730;&#x4F4D;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x8FD9;&#x53F0;&#x7535;&#x8111;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x6CA1;&#x6709;&#x4F60;&#x80AF;&#x5B9A;&#x4E0D;&#x5B8C;&#x6574;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x4F60;&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x4EF7;&#x503C;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF09;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x521D;&#x5B66;&#x8005;&#x6700;&#x559C;&#x6B22;&#x5BF9;&#x6BD4;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x6709;&#x7684;&#x5927;&#x5E08;&#x4E5F;&#x7ECF;&#x5E38;&#x5BF9;&#x6BD4;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x3002;&#x6211;&#x5E76;&#x4E0D;&#x53CD;&#x5BF9;&#x7684;&#x8BC4;&#x8BBA;&#x90A3;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x52A3;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x53BB;&#x9119;&#x89C6;&#x67D0;&#x79CD;&#x8BED;&#x8A00;&#x7684;&#x53CA;&#x5176;&#x4F7F;&#x7528;&#x8005;&#xFF0C;&#x56E0;&#x4E3A;&#x6D41;&#x884C;&#x7684;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x5B83;&#x751F;&#x5B58;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6211;&#x4EEC;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x89C1;&#x8BC6;&#x592A;&#x7A84;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x6211;&#x4EEC;&#x5BF9;&#x4EBA;&#x7C7B;&#x7684;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#x4E86;&#x89E3;&#x7684;&#x4E0D;&#x5168;&#x9762;&#xFF0C;&#x4E0D;&#x8981;&#x603B;&#x662F;&#x62FF;&#x81EA;&#x5DF1;&#x7684;&#x4E60;&#x60EF;&#x53BB;&#x8BC4;&#x4EF7;&#x3002;&#x6709;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x559C;&#x6B22;&#x7528;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x559C;&#x6B22;&#x7528;shell,perl&#x7B49;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5728;&#x6211;&#x770B;&#x6765;&#x7B80;&#x76F4;&#x662F;&#x4F4E;&#x6548;&#x4E14;&#x6613;&#x8BFB;&#x6027;&#x5DEE;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x7ECF;&#x5E38;&#x5728;&#x6CA1;&#x6709;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x4E0B;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x53EF;&#x80FD;&#x771F;&#x662F;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x9009;&#x62E9;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/06/29/ios-framework-class-diagram/" rel="prev" title="IOS 整体框架类图">
                IOS 整体框架类图 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.gif"
               alt="BirdMichael" />
          <p class="site-author-name" itemprop="name">BirdMichael</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">57</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">24</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">85</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">BirdMichael</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  



  




  
  

  

  

  

</body>
</html>
